# Comparing `tmp/composabl_dev-0.4.0.dev9-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip` & `tmp/composabl_dev-0.4.2.dev1-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,13 +1,13 @@
-Zip file size: 93037 bytes, number of entries: 11
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-04 18:54 composabl_dev-0.4.0.dev9.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-04 18:54 composabl_dev.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Aug-04 18:54 composabl/
--rw-r--r--  2.0 unx       57 b- defN 23-Aug-04 18:54 composabl_dev-0.4.0.dev9.dist-info/entry_points.txt
--rw-r--r--  2.0 unx       10 b- defN 23-Aug-04 18:54 composabl_dev-0.4.0.dev9.dist-info/top_level.txt
--rw-rw-r--  2.0 unx      769 b- defN 23-Aug-04 18:54 composabl_dev-0.4.0.dev9.dist-info/RECORD
--rw-r--r--  2.0 unx     1854 b- defN 23-Aug-04 18:54 composabl_dev-0.4.0.dev9.dist-info/METADATA
--rw-r--r--  2.0 unx      217 b- defN 23-Aug-04 18:54 composabl_dev-0.4.0.dev9.dist-info/WHEEL
--rwxr-xr-x  2.0 unx    73744 b- defN 23-Aug-04 18:54 composabl/__init__.cpython-38-x86_64-linux-gnu.so
--rwxr-xr-x  2.0 unx    87776 b- defN 23-Aug-04 18:54 composabl/core.cpython-38-x86_64-linux-gnu.so
--rwxr-xr-x  2.0 unx    87760 b- defN 23-Aug-04 18:54 composabl/ray.cpython-38-x86_64-linux-gnu.so
-11 files, 252187 bytes uncompressed, 91329 bytes compressed:  63.8%

+    <c>   DW_AT_producer    : (strp) (offset: 0xa1d): GNU C17 10.2.1 20210130 (Red Hat 10.2.1-11) -mtune=generic -march=x86-64 -g -O3 -fwrapv -fPIC
     <10>   DW_AT_language    : (data1) 12	(ANSI C99)
-    <11>   DW_AT_name        : (strp) (offset: 0x7c1): dist/build_cython/composabl/__init__.c
-    <15>   DW_AT_comp_dir    : (strp) (offset: 0x11fd): /project/composabl
-    <19>   DW_AT_ranges      : (sec_offset) 0x4b0
+    <11>   DW_AT_name        : (strp) (offset: 0x84b): dist/build_cython/composabl/__init__.c
+    <15>   DW_AT_comp_dir    : (strp) (offset: 0x1420): /project/composabl
+    <19>   DW_AT_ranges      : (sec_offset) 0x720
     <1d>   DW_AT_low_pc      : (addr) 0
     <25>   DW_AT_stmt_list   : (sec_offset) 0
  <1><29>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2a>   DW_AT_name        : (strp) (offset: 0xcd8): size_t
+    <2a>   DW_AT_name        : (strp) (offset: 0xe4c): size_t
     <2e>   DW_AT_decl_file   : (data1) 3
     <2f>   DW_AT_decl_line   : (data1) 209
     <30>   DW_AT_decl_column : (data1) 23
     <31>   DW_AT_type        : (ref4) <0x35>, long unsigned int
  <1><35>: Abbrev Number: 3 (DW_TAG_base_type)
     <36>   DW_AT_byte_size   : (data1) 8
     <37>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <38>   DW_AT_name        : (strp) (offset: 0x175a): long unsigned int
+    <38>   DW_AT_name        : (strp) (offset: 0x1a2a): long unsigned int
  <1><3c>: Abbrev Number: 3 (DW_TAG_base_type)
     <3d>   DW_AT_byte_size   : (data1) 1
     <3e>   DW_AT_encoding    : (data1) 8	(unsigned char)
-    <3f>   DW_AT_name        : (strp) (offset: 0x6f9): unsigned char
+    <3f>   DW_AT_name        : (strp) (offset: 0x783): unsigned char
  <1><43>: Abbrev Number: 3 (DW_TAG_base_type)
     <44>   DW_AT_byte_size   : (data1) 2
     <45>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <46>   DW_AT_name        : (strp) (offset: 0xf63): short unsigned int
+    <46>   DW_AT_name        : (strp) (offset: 0x115c): short unsigned int
  <1><4a>: Abbrev Number: 3 (DW_TAG_base_type)
     <4b>   DW_AT_byte_size   : (data1) 4
     <4c>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <4d>   DW_AT_name        : (strp) (offset: 0x175f): unsigned int
+    <4d>   DW_AT_name        : (strp) (offset: 0x1a2f): unsigned int
  <1><51>: Abbrev Number: 3 (DW_TAG_base_type)
     <52>   DW_AT_byte_size   : (data1) 1
     <53>   DW_AT_encoding    : (data1) 6	(signed char)
-    <54>   DW_AT_name        : (strp) (offset: 0x6fb): signed char
+    <54>   DW_AT_name        : (strp) (offset: 0x785): signed char
  <1><58>: Abbrev Number: 3 (DW_TAG_base_type)
     <59>   DW_AT_byte_size   : (data1) 2
     <5a>   DW_AT_encoding    : (data1) 5	(signed)
-    <5b>   DW_AT_name        : (strp) (offset: 0x1b36): short int
+    <5b>   DW_AT_name        : (strp) (offset: 0x1e56): short int
  <1><5f>: Abbrev Number: 4 (DW_TAG_base_type)
     <60>   DW_AT_byte_size   : (data1) 4
     <61>   DW_AT_encoding    : (data1) 5	(signed)
     <62>   DW_AT_name        : (string) int
  <1><66>: Abbrev Number: 3 (DW_TAG_base_type)
     <67>   DW_AT_byte_size   : (data1) 8
     <68>   DW_AT_encoding    : (data1) 5	(signed)
-    <69>   DW_AT_name        : (strp) (offset: 0x1987): long int
+    <69>   DW_AT_name        : (strp) (offset: 0x1c77): long int
  <1><6d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6e>   DW_AT_name        : (strp) (offset: 0x23e): __off_t
+    <6e>   DW_AT_name        : (strp) (offset: 0x26d): __off_t
     <72>   DW_AT_decl_file   : (data1) 4
     <73>   DW_AT_decl_line   : (data1) 140
     <74>   DW_AT_decl_column : (data1) 25
     <75>   DW_AT_type        : (ref4) <0x66>, long int
  <1><79>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7a>   DW_AT_name        : (strp) (offset: 0xfd7): __off64_t
+    <7a>   DW_AT_name        : (strp) (offset: 0x11da): __off64_t
     <7e>   DW_AT_decl_file   : (data1) 4
     <7f>   DW_AT_decl_line   : (data1) 141
     <80>   DW_AT_decl_column : (data1) 27
     <81>   DW_AT_type        : (ref4) <0x66>, long int
  <1><85>: Abbrev Number: 5 (DW_TAG_pointer_type)
     <86>   DW_AT_byte_size   : (data1) 8
  <1><87>: Abbrev Number: 2 (DW_TAG_typedef)
-    <88>   DW_AT_name        : (strp) (offset: 0xcd5): __ssize_t
+    <88>   DW_AT_name        : (strp) (offset: 0xe49): __ssize_t
     <8c>   DW_AT_decl_file   : (data1) 4
     <8d>   DW_AT_decl_line   : (data1) 181
     <8e>   DW_AT_decl_column : (data1) 27
     <8f>   DW_AT_type        : (ref4) <0x66>, long int
  <1><93>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <94>   DW_AT_byte_size   : (data1) 8
     <95>   DW_AT_type        : (ref4) <0x99>, char
  <1><99>: Abbrev Number: 3 (DW_TAG_base_type)
     <9a>   DW_AT_byte_size   : (data1) 1
     <9b>   DW_AT_encoding    : (data1) 6	(signed char)
-    <9c>   DW_AT_name        : (strp) (offset: 0x702): char
+    <9c>   DW_AT_name        : (strp) (offset: 0x78c): char
  <1><a0>: Abbrev Number: 7 (DW_TAG_const_type)
     <a1>   DW_AT_type        : (ref4) <0x99>, char
  <1><a5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <a6>   DW_AT_name        : (strp) (offset: 0x13c1): FILE
+    <a6>   DW_AT_name        : (strp) (offset: 0x1647): FILE
     <aa>   DW_AT_decl_file   : (data1) 5
     <ab>   DW_AT_decl_line   : (data1) 48
     <ac>   DW_AT_decl_column : (data1) 25
     <ad>   DW_AT_type        : (ref4) <0xb1>, _IO_FILE
  <1><b1>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <b2>   DW_AT_name        : (strp) (offset: 0x13bd): _IO_FILE
+    <b2>   DW_AT_name        : (strp) (offset: 0x1643): _IO_FILE
     <b6>   DW_AT_byte_size   : (data1) 216
     <b7>   DW_AT_decl_file   : (data1) 6
     <b8>   DW_AT_decl_line   : (data1) 246
     <b9>   DW_AT_decl_column : (data1) 8
     <ba>   DW_AT_sibling     : (ref4) <0x250>
  <2><be>: Abbrev Number: 9 (DW_TAG_member)
-    <bf>   DW_AT_name        : (strp) (offset: 0xddb): _flags
+    <bf>   DW_AT_name        : (strp) (offset: 0xfab): _flags
     <c3>   DW_AT_decl_file   : (data1) 6
     <c4>   DW_AT_decl_line   : (data1) 247
     <c5>   DW_AT_decl_column : (data1) 7
     <c6>   DW_AT_type        : (ref4) <0x5f>, int
     <ca>   DW_AT_data_member_location: (data1) 0
  <2><cb>: Abbrev Number: 9 (DW_TAG_member)
-    <cc>   DW_AT_name        : (strp) (offset: 0x1813): _IO_read_ptr
+    <cc>   DW_AT_name        : (strp) (offset: 0x1af6): _IO_read_ptr
     <d0>   DW_AT_decl_file   : (data1) 6
     <d1>   DW_AT_decl_line   : (data1) 252
     <d2>   DW_AT_decl_column : (data1) 9
     <d3>   DW_AT_type        : (ref4) <0x93>, char
     <d7>   DW_AT_data_member_location: (data1) 8
  <2><d8>: Abbrev Number: 9 (DW_TAG_member)
-    <d9>   DW_AT_name        : (strp) (offset: 0x139e): _IO_read_end
+    <d9>   DW_AT_name        : (strp) (offset: 0x160e): _IO_read_end
     <dd>   DW_AT_decl_file   : (data1) 6
     <de>   DW_AT_decl_line   : (data1) 253
     <df>   DW_AT_decl_column : (data1) 9
     <e0>   DW_AT_type        : (ref4) <0x93>, char
     <e4>   DW_AT_data_member_location: (data1) 16
  <2><e5>: Abbrev Number: 9 (DW_TAG_member)
-    <e6>   DW_AT_name        : (strp) (offset: 0xfe9): _IO_read_base
+    <e6>   DW_AT_name        : (strp) (offset: 0x11ec): _IO_read_base
     <ea>   DW_AT_decl_file   : (data1) 6
     <eb>   DW_AT_decl_line   : (data1) 254
     <ec>   DW_AT_decl_column : (data1) 9
     <ed>   DW_AT_type        : (ref4) <0x93>, char
     <f1>   DW_AT_data_member_location: (data1) 24
  <2><f2>: Abbrev Number: 9 (DW_TAG_member)
-    <f3>   DW_AT_name        : (strp) (offset: 0x1088): _IO_write_base
+    <f3>   DW_AT_name        : (strp) (offset: 0x128b): _IO_write_base
     <f7>   DW_AT_decl_file   : (data1) 6
     <f8>   DW_AT_decl_line   : (data1) 255
     <f9>   DW_AT_decl_column : (data1) 9
     <fa>   DW_AT_type        : (ref4) <0x93>, char
     <fe>   DW_AT_data_member_location: (data1) 32
  <2><ff>: Abbrev Number: 10 (DW_TAG_member)
-    <100>   DW_AT_name        : (strp) (offset: 0x925): _IO_write_ptr
+    <100>   DW_AT_name        : (strp) (offset: 0x9ea): _IO_write_ptr
     <104>   DW_AT_decl_file   : (data1) 6
     <105>   DW_AT_decl_line   : (data2) 256
     <107>   DW_AT_decl_column : (data1) 9
     <108>   DW_AT_type        : (ref4) <0x93>, char
     <10c>   DW_AT_data_member_location: (data1) 40
  <2><10d>: Abbrev Number: 10 (DW_TAG_member)
-    <10e>   DW_AT_name        : (strp) (offset: 0x399): _IO_write_end
+    <10e>   DW_AT_name        : (strp) (offset: 0x3f5): _IO_write_end
     <112>   DW_AT_decl_file   : (data1) 6
     <113>   DW_AT_decl_line   : (data2) 257
     <115>   DW_AT_decl_column : (data1) 9
     <116>   DW_AT_type        : (ref4) <0x93>, char
     <11a>   DW_AT_data_member_location: (data1) 48
  <2><11b>: Abbrev Number: 10 (DW_TAG_member)
-    <11c>   DW_AT_name        : (strp) (offset: 0x134a): _IO_buf_base
+    <11c>   DW_AT_name        : (strp) (offset: 0x15ba): _IO_buf_base
     <120>   DW_AT_decl_file   : (data1) 6
     <121>   DW_AT_decl_line   : (data2) 258
     <123>   DW_AT_decl_column : (data1) 9
     <124>   DW_AT_type        : (ref4) <0x93>, char
     <128>   DW_AT_data_member_location: (data1) 56
  <2><129>: Abbrev Number: 10 (DW_TAG_member)
-    <12a>   DW_AT_name        : (strp) (offset: 0x1039): _IO_buf_end
+    <12a>   DW_AT_name        : (strp) (offset: 0x123c): _IO_buf_end
     <12e>   DW_AT_decl_file   : (data1) 6
     <12f>   DW_AT_decl_line   : (data2) 259
     <131>   DW_AT_decl_column : (data1) 9
     <132>   DW_AT_type        : (ref4) <0x93>, char
     <136>   DW_AT_data_member_location: (data1) 64
  <2><137>: Abbrev Number: 10 (DW_TAG_member)
-    <138>   DW_AT_name        : (strp) (offset: 0xb2d): _IO_save_base
+    <138>   DW_AT_name        : (strp) (offset: 0xc33): _IO_save_base
     <13c>   DW_AT_decl_file   : (data1) 6
     <13d>   DW_AT_decl_line   : (data2) 261
     <13f>   DW_AT_decl_column : (data1) 9
     <140>   DW_AT_type        : (ref4) <0x93>, char
     <144>   DW_AT_data_member_location: (data1) 72
  <2><145>: Abbrev Number: 10 (DW_TAG_member)
-    <146>   DW_AT_name        : (strp) (offset: 0x1803): _IO_backup_base
+    <146>   DW_AT_name        : (strp) (offset: 0x1ae6): _IO_backup_base
     <14a>   DW_AT_decl_file   : (data1) 6
     <14b>   DW_AT_decl_line   : (data2) 262
     <14d>   DW_AT_decl_column : (data1) 9
     <14e>   DW_AT_type        : (ref4) <0x93>, char
     <152>   DW_AT_data_member_location: (data1) 80
  <2><153>: Abbrev Number: 10 (DW_TAG_member)
-    <154>   DW_AT_name        : (strp) (offset: 0xe91): _IO_save_end
+    <154>   DW_AT_name        : (strp) (offset: 0x1071): _IO_save_end
     <158>   DW_AT_decl_file   : (data1) 6
     <159>   DW_AT_decl_line   : (data2) 263
     <15b>   DW_AT_decl_column : (data1) 9
     <15c>   DW_AT_type        : (ref4) <0x93>, char
     <160>   DW_AT_data_member_location: (data1) 88
  <2><161>: Abbrev Number: 10 (DW_TAG_member)
-    <162>   DW_AT_name        : (strp) (offset: 0x14ab): _markers
+    <162>   DW_AT_name        : (strp) (offset: 0x1771): _markers
     <166>   DW_AT_decl_file   : (data1) 6
     <167>   DW_AT_decl_line   : (data2) 265
     <169>   DW_AT_decl_column : (data1) 22
     <16a>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
     <16e>   DW_AT_data_member_location: (data1) 96
  <2><16f>: Abbrev Number: 10 (DW_TAG_member)
-    <170>   DW_AT_name        : (strp) (offset: 0x683): _chain
+    <170>   DW_AT_name        : (strp) (offset: 0x70d): _chain
     <174>   DW_AT_decl_file   : (data1) 6
     <175>   DW_AT_decl_line   : (data2) 267
     <177>   DW_AT_decl_column : (data1) 20
     <178>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
     <17c>   DW_AT_data_member_location: (data1) 104
  <2><17d>: Abbrev Number: 10 (DW_TAG_member)
-    <17e>   DW_AT_name        : (strp) (offset: 0x27): _fileno
+    <17e>   DW_AT_name        : (strp) (offset: 0x41): _fileno
     <182>   DW_AT_decl_file   : (data1) 6
     <183>   DW_AT_decl_line   : (data2) 269
     <185>   DW_AT_decl_column : (data1) 7
     <186>   DW_AT_type        : (ref4) <0x5f>, int
     <18a>   DW_AT_data_member_location: (data1) 112
  <2><18b>: Abbrev Number: 10 (DW_TAG_member)
-    <18c>   DW_AT_name        : (strp) (offset: 0x19b2): _flags2
+    <18c>   DW_AT_name        : (strp) (offset: 0x1ca2): _flags2
     <190>   DW_AT_decl_file   : (data1) 6
     <191>   DW_AT_decl_line   : (data2) 273
     <193>   DW_AT_decl_column : (data1) 7
     <194>   DW_AT_type        : (ref4) <0x5f>, int
     <198>   DW_AT_data_member_location: (data1) 116
  <2><199>: Abbrev Number: 10 (DW_TAG_member)
-    <19a>   DW_AT_name        : (strp) (offset: 0x1936): _old_offset
+    <19a>   DW_AT_name        : (strp) (offset: 0x1c26): _old_offset
     <19e>   DW_AT_decl_file   : (data1) 6
     <19f>   DW_AT_decl_line   : (data2) 275
     <1a1>   DW_AT_decl_column : (data1) 13
     <1a2>   DW_AT_type        : (ref4) <0x6d>, __off_t, long int
     <1a6>   DW_AT_data_member_location: (data1) 120
  <2><1a7>: Abbrev Number: 10 (DW_TAG_member)
-    <1a8>   DW_AT_name        : (strp) (offset: 0x177c): _cur_column
+    <1a8>   DW_AT_name        : (strp) (offset: 0x1a4c): _cur_column
     <1ac>   DW_AT_decl_file   : (data1) 6
     <1ad>   DW_AT_decl_line   : (data2) 279
     <1af>   DW_AT_decl_column : (data1) 18
     <1b0>   DW_AT_type        : (ref4) <0x43>, short unsigned int
     <1b4>   DW_AT_data_member_location: (data1) 128
  <2><1b5>: Abbrev Number: 10 (DW_TAG_member)
-    <1b6>   DW_AT_name        : (strp) (offset: 0x1b45): _vtable_offset
+    <1b6>   DW_AT_name        : (strp) (offset: 0x1e65): _vtable_offset
     <1ba>   DW_AT_decl_file   : (data1) 6
     <1bb>   DW_AT_decl_line   : (data2) 280
     <1bd>   DW_AT_decl_column : (data1) 15
     <1be>   DW_AT_type        : (ref4) <0x51>, signed char
     <1c2>   DW_AT_data_member_location: (data1) 130
  <2><1c3>: Abbrev Number: 10 (DW_TAG_member)
-    <1c4>   DW_AT_name        : (strp) (offset: 0x16c): _shortbuf
+    <1c4>   DW_AT_name        : (strp) (offset: 0x19b): _shortbuf
     <1c8>   DW_AT_decl_file   : (data1) 6
     <1c9>   DW_AT_decl_line   : (data2) 281
     <1cb>   DW_AT_decl_column : (data1) 8
     <1cc>   DW_AT_type        : (ref4) <0x299>, char
     <1d0>   DW_AT_data_member_location: (data1) 131
  <2><1d1>: Abbrev Number: 10 (DW_TAG_member)
-    <1d2>   DW_AT_name        : (strp) (offset: 0x26a): _lock
+    <1d2>   DW_AT_name        : (strp) (offset: 0x299): _lock
     <1d6>   DW_AT_decl_file   : (data1) 6
     <1d7>   DW_AT_decl_line   : (data2) 285
     <1d9>   DW_AT_decl_column : (data1) 15
     <1da>   DW_AT_type        : (ref4) <0x2a9>, _IO_lock_t
     <1de>   DW_AT_data_member_location: (data1) 136
  <2><1df>: Abbrev Number: 10 (DW_TAG_member)
-    <1e0>   DW_AT_name        : (strp) (offset: 0x193a): _offset
+    <1e0>   DW_AT_name        : (strp) (offset: 0x1c2a): _offset
     <1e4>   DW_AT_decl_file   : (data1) 6
     <1e5>   DW_AT_decl_line   : (data2) 294
     <1e7>   DW_AT_decl_column : (data1) 15
     <1e8>   DW_AT_type        : (ref4) <0x79>, __off64_t, long int
     <1ec>   DW_AT_data_member_location: (data1) 144
  <2><1ed>: Abbrev Number: 10 (DW_TAG_member)
-    <1ee>   DW_AT_name        : (strp) (offset: 0x1464): __pad1
+    <1ee>   DW_AT_name        : (strp) (offset: 0x1714): __pad1
     <1f2>   DW_AT_decl_file   : (data1) 6
     <1f3>   DW_AT_decl_line   : (data2) 303
     <1f5>   DW_AT_decl_column : (data1) 9
     <1f6>   DW_AT_type        : (ref4) <0x85>
     <1fa>   DW_AT_data_member_location: (data1) 152
  <2><1fb>: Abbrev Number: 10 (DW_TAG_member)
-    <1fc>   DW_AT_name        : (strp) (offset: 0xbdf): __pad2
+    <1fc>   DW_AT_name        : (strp) (offset: 0xced): __pad2
     <200>   DW_AT_decl_file   : (data1) 6
     <201>   DW_AT_decl_line   : (data2) 304
     <203>   DW_AT_decl_column : (data1) 9
     <204>   DW_AT_type        : (ref4) <0x85>
     <208>   DW_AT_data_member_location: (data1) 160
  <2><209>: Abbrev Number: 10 (DW_TAG_member)
-    <20a>   DW_AT_name        : (strp) (offset: 0x146b): __pad3
+    <20a>   DW_AT_name        : (strp) (offset: 0x171b): __pad3
     <20e>   DW_AT_decl_file   : (data1) 6
     <20f>   DW_AT_decl_line   : (data2) 305
     <211>   DW_AT_decl_column : (data1) 9
     <212>   DW_AT_type        : (ref4) <0x85>
     <216>   DW_AT_data_member_location: (data1) 168
  <2><217>: Abbrev Number: 10 (DW_TAG_member)
-    <218>   DW_AT_name        : (strp) (offset: 0x1472): __pad4
+    <218>   DW_AT_name        : (strp) (offset: 0x1722): __pad4
     <21c>   DW_AT_decl_file   : (data1) 6
     <21d>   DW_AT_decl_line   : (data2) 306
     <21f>   DW_AT_decl_column : (data1) 9
     <220>   DW_AT_type        : (ref4) <0x85>
     <224>   DW_AT_data_member_location: (data1) 176
  <2><225>: Abbrev Number: 10 (DW_TAG_member)
-    <226>   DW_AT_name        : (strp) (offset: 0x1479): __pad5
+    <226>   DW_AT_name        : (strp) (offset: 0x1729): __pad5
     <22a>   DW_AT_decl_file   : (data1) 6
     <22b>   DW_AT_decl_line   : (data2) 307
     <22d>   DW_AT_decl_column : (data1) 10
     <22e>   DW_AT_type        : (ref4) <0x29>, size_t, long unsigned int
     <232>   DW_AT_data_member_location: (data1) 184
  <2><233>: Abbrev Number: 10 (DW_TAG_member)
-    <234>   DW_AT_name        : (strp) (offset: 0x1077): _mode
+    <234>   DW_AT_name        : (strp) (offset: 0x127a): _mode
     <238>   DW_AT_decl_file   : (data1) 6
     <239>   DW_AT_decl_line   : (data2) 309
     <23b>   DW_AT_decl_column : (data1) 7
     <23c>   DW_AT_type        : (ref4) <0x5f>, int
     <240>   DW_AT_data_member_location: (data1) 192
  <2><241>: Abbrev Number: 10 (DW_TAG_member)
-    <242>   DW_AT_name        : (strp) (offset: 0x1e): _unused2
+    <242>   DW_AT_name        : (strp) (offset: 0x38): _unused2
     <246>   DW_AT_decl_file   : (data1) 6
     <247>   DW_AT_decl_line   : (data2) 311
     <249>   DW_AT_decl_column : (data1) 8
     <24a>   DW_AT_type        : (ref4) <0x2af>, char
     <24e>   DW_AT_data_member_location: (data1) 196
  <2><24f>: Abbrev Number: 0
  <1><250>: Abbrev Number: 11 (DW_TAG_typedef)
-    <251>   DW_AT_name        : (strp) (offset: 0x723): _IO_lock_t
+    <251>   DW_AT_name        : (strp) (offset: 0x7ad): _IO_lock_t
     <255>   DW_AT_decl_file   : (data1) 6
     <256>   DW_AT_decl_line   : (data1) 155
     <257>   DW_AT_decl_column : (data1) 14
  <1><258>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <259>   DW_AT_name        : (strp) (offset: 0x10ff): _IO_marker
+    <259>   DW_AT_name        : (strp) (offset: 0x130c): _IO_marker
     <25d>   DW_AT_byte_size   : (data1) 24
     <25e>   DW_AT_decl_file   : (data1) 6
     <25f>   DW_AT_decl_line   : (data1) 161
     <260>   DW_AT_decl_column : (data1) 8
     <261>   DW_AT_sibling     : (ref4) <0x28d>
  <2><265>: Abbrev Number: 9 (DW_TAG_member)
-    <266>   DW_AT_name        : (strp) (offset: 0xc42): _next
+    <266>   DW_AT_name        : (strp) (offset: 0xda2): _next
     <26a>   DW_AT_decl_file   : (data1) 6
     <26b>   DW_AT_decl_line   : (data1) 162
     <26c>   DW_AT_decl_column : (data1) 22
     <26d>   DW_AT_type        : (ref4) <0x28d>, _IO_marker
     <271>   DW_AT_data_member_location: (data1) 0
  <2><272>: Abbrev Number: 9 (DW_TAG_member)
-    <273>   DW_AT_name        : (strp) (offset: 0xe8b): _sbuf
+    <273>   DW_AT_name        : (strp) (offset: 0x105b): _sbuf
     <277>   DW_AT_decl_file   : (data1) 6
     <278>   DW_AT_decl_line   : (data1) 163
     <279>   DW_AT_decl_column : (data1) 20
     <27a>   DW_AT_type        : (ref4) <0x293>, _IO_FILE
     <27e>   DW_AT_data_member_location: (data1) 8
  <2><27f>: Abbrev Number: 9 (DW_TAG_member)
-    <280>   DW_AT_name        : (strp) (offset: 0x14b4): _pos
+    <280>   DW_AT_name        : (strp) (offset: 0x177a): _pos
     <284>   DW_AT_decl_file   : (data1) 6
     <285>   DW_AT_decl_line   : (data1) 167
     <286>   DW_AT_decl_column : (data1) 7
     <287>   DW_AT_type        : (ref4) <0x5f>, int
     <28b>   DW_AT_data_member_location: (data1) 16
  <2><28c>: Abbrev Number: 0
  <1><28d>: Abbrev Number: 6 (DW_TAG_pointer_type)
@@ -354,7353 +354,8985 @@
     <2b9>   DW_AT_type        : (ref4) <0x35>, long unsigned int
     <2bd>   DW_AT_upper_bound : (data1) 19
  <2><2be>: Abbrev Number: 0
  <1><2bf>: Abbrev Number: 6 (DW_TAG_pointer_type)
     <2c0>   DW_AT_byte_size   : (data1) 8
     <2c1>   DW_AT_type        : (ref4) <0xa0>, char
  <1><2c5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2c6>   DW_AT_name        : (strp) (offset: 0xcd7): ssize_t
+    <2c6>   DW_AT_name        : (strp) (offset: 0xe4b): ssize_t
     <2ca>   DW_AT_decl_file   : (data1) 5
     <2cb>   DW_AT_decl_line   : (data1) 102
     <2cc>   DW_AT_decl_column : (data1) 19
     <2cd>   DW_AT_type        : (ref4) <0x87>, __ssize_t, long int
  <1><2d1>: Abbrev Number: 14 (DW_TAG_typedef)
-    <2d2>   DW_AT_name        : (strp) (offset: 0xfe1): wchar_t
+    <2d2>   DW_AT_name        : (strp) (offset: 0x11e4): wchar_t
     <2d6>   DW_AT_decl_file   : (data1) 3
     <2d7>   DW_AT_decl_line   : (data2) 321
     <2d9>   DW_AT_decl_column : (data1) 24
     <2da>   DW_AT_type        : (ref4) <0x5f>, int
  <1><2de>: Abbrev Number: 3 (DW_TAG_base_type)
     <2df>   DW_AT_byte_size   : (data1) 8
     <2e0>   DW_AT_encoding    : (data1) 5	(signed)
-    <2e1>   DW_AT_name        : (strp) (offset: 0x1982): long long int
+    <2e1>   DW_AT_name        : (strp) (offset: 0x1c72): long long int
  <1><2e5>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2e6>   DW_AT_name        : (strp) (offset: 0x811): int64_t
+    <2e6>   DW_AT_name        : (strp) (offset: 0x89b): int64_t
     <2ea>   DW_AT_decl_file   : (data1) 7
     <2eb>   DW_AT_decl_line   : (data1) 197
     <2ec>   DW_AT_decl_column : (data1) 1
     <2ed>   DW_AT_type        : (ref4) <0x66>, long int
  <1><2f1>: Abbrev Number: 3 (DW_TAG_base_type)
     <2f2>   DW_AT_byte_size   : (data1) 8
     <2f3>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <2f4>   DW_AT_name        : (strp) (offset: 0x1755): long long unsigned int
+    <2f4>   DW_AT_name        : (strp) (offset: 0x1a25): long long unsigned int
  <1><2f8>: Abbrev Number: 2 (DW_TAG_typedef)
-    <2f9>   DW_AT_name        : (strp) (offset: 0x11be): uint32_t
+    <2f9>   DW_AT_name        : (strp) (offset: 0xb74): uint8_t
     <2fd>   DW_AT_decl_file   : (data1) 8
-    <2fe>   DW_AT_decl_line   : (data1) 51
-    <2ff>   DW_AT_decl_column : (data1) 23
-    <300>   DW_AT_type        : (ref4) <0x4a>, unsigned int
+    <2fe>   DW_AT_decl_line   : (data1) 48
+    <2ff>   DW_AT_decl_column : (data1) 24
+    <300>   DW_AT_type        : (ref4) <0x3c>, unsigned char
  <1><304>: Abbrev Number: 2 (DW_TAG_typedef)
-    <305>   DW_AT_name        : (strp) (offset: 0x810): uint64_t
+    <305>   DW_AT_name        : (strp) (offset: 0x221): uint16_t
     <309>   DW_AT_decl_file   : (data1) 8
-    <30a>   DW_AT_decl_line   : (data1) 55
-    <30b>   DW_AT_decl_column : (data1) 27
-    <30c>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <30a>   DW_AT_decl_line   : (data1) 49
+    <30b>   DW_AT_decl_column : (data1) 28
+    <30c>   DW_AT_type        : (ref4) <0x43>, short unsigned int
  <1><310>: Abbrev Number: 2 (DW_TAG_typedef)
-    <311>   DW_AT_name        : (strp) (offset: 0x192b): Py_ssize_t
-    <315>   DW_AT_decl_file   : (data1) 9
-    <316>   DW_AT_decl_line   : (data1) 105
-    <317>   DW_AT_decl_column : (data1) 25
-    <318>   DW_AT_type        : (ref4) <0x2c5>, ssize_t, __ssize_t, long int
- <1><31c>: Abbrev Number: 7 (DW_TAG_const_type)
-    <31d>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><321>: Abbrev Number: 2 (DW_TAG_typedef)
-    <322>   DW_AT_name        : (strp) (offset: 0xc2b): Py_hash_t
-    <326>   DW_AT_decl_file   : (data1) 9
-    <327>   DW_AT_decl_line   : (data1) 114
-    <328>   DW_AT_decl_column : (data1) 20
-    <329>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><32d>: Abbrev Number: 3 (DW_TAG_base_type)
-    <32e>   DW_AT_byte_size   : (data1) 4
-    <32f>   DW_AT_encoding    : (data1) 4	(float)
-    <330>   DW_AT_name        : (strp) (offset: 0x1163): float
- <1><334>: Abbrev Number: 3 (DW_TAG_base_type)
-    <335>   DW_AT_byte_size   : (data1) 8
-    <336>   DW_AT_encoding    : (data1) 4	(float)
-    <337>   DW_AT_name        : (strp) (offset: 0x31a): double
- <1><33b>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <33c>   DW_AT_name        : (strp) (offset: 0x18eb): timezone
-    <340>   DW_AT_byte_size   : (data1) 8
-    <341>   DW_AT_decl_file   : (data1) 10
-    <342>   DW_AT_decl_line   : (data1) 56
-    <343>   DW_AT_decl_column : (data1) 8
-    <344>   DW_AT_sibling     : (ref4) <0x363>
- <2><348>: Abbrev Number: 9 (DW_TAG_member)
-    <349>   DW_AT_name        : (strp) (offset: 0x1bd6): tz_minuteswest
-    <34d>   DW_AT_decl_file   : (data1) 10
-    <34e>   DW_AT_decl_line   : (data1) 58
-    <34f>   DW_AT_decl_column : (data1) 9
-    <350>   DW_AT_type        : (ref4) <0x5f>, int
-    <354>   DW_AT_data_member_location: (data1) 0
- <2><355>: Abbrev Number: 9 (DW_TAG_member)
-    <356>   DW_AT_name        : (strp) (offset: 0x109e): tz_dsttime
-    <35a>   DW_AT_decl_file   : (data1) 10
-    <35b>   DW_AT_decl_line   : (data1) 59
-    <35c>   DW_AT_decl_column : (data1) 9
-    <35d>   DW_AT_type        : (ref4) <0x5f>, int
-    <361>   DW_AT_data_member_location: (data1) 4
- <2><362>: Abbrev Number: 0
- <1><363>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <364>   DW_AT_byte_size   : (data1) 8
-    <365>   DW_AT_type        : (ref4) <0x33b>, timezone
- <1><369>: Abbrev Number: 15 (DW_TAG_restrict_type)
-    <36a>   DW_AT_type        : (ref4) <0x363>, timezone
- <1><36e>: Abbrev Number: 8 (DW_TAG_structure_type)
-    <36f>   DW_AT_name        : (strp) (offset: 0x419): _object
-    <373>   DW_AT_byte_size   : (data1) 16
-    <374>   DW_AT_decl_file   : (data1) 2
-    <375>   DW_AT_decl_line   : (data1) 104
-    <376>   DW_AT_decl_column : (data1) 16
-    <377>   DW_AT_sibling     : (ref4) <0x396>
- <2><37b>: Abbrev Number: 9 (DW_TAG_member)
-    <37c>   DW_AT_name        : (strp) (offset: 0xcb): ob_refcnt
-    <380>   DW_AT_decl_file   : (data1) 2
-    <381>   DW_AT_decl_line   : (data1) 106
-    <382>   DW_AT_decl_column : (data1) 16
-    <383>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <387>   DW_AT_data_member_location: (data1) 0
- <2><388>: Abbrev Number: 9 (DW_TAG_member)
-    <389>   DW_AT_name        : (strp) (offset: 0x457): ob_type
-    <38d>   DW_AT_decl_file   : (data1) 2
-    <38e>   DW_AT_decl_line   : (data1) 107
-    <38f>   DW_AT_decl_column : (data1) 25
-    <390>   DW_AT_type        : (ref4) <0x646>, _typeobject
-    <394>   DW_AT_data_member_location: (data1) 8
- <2><395>: Abbrev Number: 0
- <1><396>: Abbrev Number: 16 (DW_TAG_structure_type)
-    <397>   DW_AT_name        : (strp) (offset: 0x2c0): _typeobject
-    <39b>   DW_AT_byte_size   : (data2) 416
-    <39d>   DW_AT_decl_file   : (data1) 11
-    <39e>   DW_AT_decl_line   : (data1) 177
-    <39f>   DW_AT_decl_column : (data1) 16
-    <3a0>   DW_AT_sibling     : (ref4) <0x646>
- <2><3a4>: Abbrev Number: 9 (DW_TAG_member)
-    <3a5>   DW_AT_name        : (strp) (offset: 0x5b9): ob_base
-    <3a9>   DW_AT_decl_file   : (data1) 11
-    <3aa>   DW_AT_decl_line   : (data1) 178
-    <3ab>   DW_AT_decl_column : (data1) 5
-    <3ac>   DW_AT_type        : (ref4) <0x67c>, PyVarObject
-    <3b0>   DW_AT_data_member_location: (data1) 0
- <2><3b1>: Abbrev Number: 9 (DW_TAG_member)
-    <3b2>   DW_AT_name        : (strp) (offset: 0xec8): tp_name
-    <3b6>   DW_AT_decl_file   : (data1) 11
-    <3b7>   DW_AT_decl_line   : (data1) 179
-    <3b8>   DW_AT_decl_column : (data1) 17
-    <3b9>   DW_AT_type        : (ref4) <0x2bf>, char
-    <3bd>   DW_AT_data_member_location: (data1) 24
- <2><3be>: Abbrev Number: 9 (DW_TAG_member)
-    <3bf>   DW_AT_name        : (strp) (offset: 0x1b7e): tp_basicsize
-    <3c3>   DW_AT_decl_file   : (data1) 11
-    <3c4>   DW_AT_decl_line   : (data1) 180
-    <3c5>   DW_AT_decl_column : (data1) 16
-    <3c6>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <3ca>   DW_AT_data_member_location: (data1) 32
- <2><3cb>: Abbrev Number: 9 (DW_TAG_member)
-    <3cc>   DW_AT_name        : (strp) (offset: 0x1ef): tp_itemsize
-    <3d0>   DW_AT_decl_file   : (data1) 11
-    <3d1>   DW_AT_decl_line   : (data1) 180
-    <3d2>   DW_AT_decl_column : (data1) 30
-    <3d3>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <3d7>   DW_AT_data_member_location: (data1) 40
- <2><3d8>: Abbrev Number: 9 (DW_TAG_member)
-    <3d9>   DW_AT_name        : (strp) (offset: 0x2b5): tp_dealloc
-    <3dd>   DW_AT_decl_file   : (data1) 11
-    <3de>   DW_AT_decl_line   : (data1) 184
-    <3df>   DW_AT_decl_column : (data1) 16
-    <3e0>   DW_AT_type        : (ref4) <0x857>, destructor
-    <3e4>   DW_AT_data_member_location: (data1) 48
- <2><3e5>: Abbrev Number: 9 (DW_TAG_member)
-    <3e6>   DW_AT_name        : (strp) (offset: 0x11a1): tp_vectorcall_offset
-    <3ea>   DW_AT_decl_file   : (data1) 11
-    <3eb>   DW_AT_decl_line   : (data1) 185
-    <3ec>   DW_AT_decl_column : (data1) 16
-    <3ed>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <3f1>   DW_AT_data_member_location: (data1) 56
- <2><3f2>: Abbrev Number: 9 (DW_TAG_member)
-    <3f3>   DW_AT_name        : (strp) (offset: 0x94): tp_getattr
-    <3f7>   DW_AT_decl_file   : (data1) 11
-    <3f8>   DW_AT_decl_line   : (data1) 186
-    <3f9>   DW_AT_decl_column : (data1) 17
-    <3fa>   DW_AT_type        : (ref4) <0x874>, getattrfunc, PyObject, _object
-    <3fe>   DW_AT_data_member_location: (data1) 64
- <2><3ff>: Abbrev Number: 9 (DW_TAG_member)
-    <400>   DW_AT_name        : (strp) (offset: 0x6a2): tp_setattr
-    <404>   DW_AT_decl_file   : (data1) 11
-    <405>   DW_AT_decl_line   : (data1) 187
-    <406>   DW_AT_decl_column : (data1) 17
-    <407>   DW_AT_type        : (ref4) <0x8a6>, setattrfunc, int
-    <40b>   DW_AT_data_member_location: (data1) 72
- <2><40c>: Abbrev Number: 9 (DW_TAG_member)
-    <40d>   DW_AT_name        : (strp) (offset: 0x111): tp_as_async
-    <411>   DW_AT_decl_file   : (data1) 11
-    <412>   DW_AT_decl_line   : (data1) 188
-    <413>   DW_AT_decl_column : (data1) 21
-    <414>   DW_AT_type        : (ref4) <0xe44>, PyAsyncMethods
-    <418>   DW_AT_data_member_location: (data1) 80
- <2><419>: Abbrev Number: 9 (DW_TAG_member)
-    <41a>   DW_AT_name        : (strp) (offset: 0x18f4): tp_repr
-    <41e>   DW_AT_decl_file   : (data1) 11
-    <41f>   DW_AT_decl_line   : (data1) 190
-    <420>   DW_AT_decl_column : (data1) 14
-    <421>   DW_AT_type        : (ref4) <0x8dd>, reprfunc, PyObject, _object
-    <425>   DW_AT_data_member_location: (data1) 88
- <2><426>: Abbrev Number: 9 (DW_TAG_member)
-    <427>   DW_AT_name        : (strp) (offset: 0x1210): tp_as_number
-    <42b>   DW_AT_decl_file   : (data1) 11
-    <42c>   DW_AT_decl_line   : (data1) 194
-    <42d>   DW_AT_decl_column : (data1) 22
-    <42e>   DW_AT_type        : (ref4) <0xe4a>, PyNumberMethods
-    <432>   DW_AT_data_member_location: (data1) 96
- <2><433>: Abbrev Number: 9 (DW_TAG_member)
-    <434>   DW_AT_name        : (strp) (offset: 0xf09): tp_as_sequence
-    <438>   DW_AT_decl_file   : (data1) 11
-    <439>   DW_AT_decl_line   : (data1) 195
-    <43a>   DW_AT_decl_column : (data1) 24
-    <43b>   DW_AT_type        : (ref4) <0xe50>, PySequenceMethods
-    <43f>   DW_AT_data_member_location: (data1) 104
- <2><440>: Abbrev Number: 9 (DW_TAG_member)
-    <441>   DW_AT_name        : (strp) (offset: 0x933): tp_as_mapping
-    <445>   DW_AT_decl_file   : (data1) 11
-    <446>   DW_AT_decl_line   : (data1) 196
-    <447>   DW_AT_decl_column : (data1) 23
-    <448>   DW_AT_type        : (ref4) <0xe56>, PyMappingMethods
-    <44c>   DW_AT_data_member_location: (data1) 112
- <2><44d>: Abbrev Number: 9 (DW_TAG_member)
-    <44e>   DW_AT_name        : (strp) (offset: 0x13fa): tp_hash
-    <452>   DW_AT_decl_file   : (data1) 11
-    <453>   DW_AT_decl_line   : (data1) 200
-    <454>   DW_AT_decl_column : (data1) 14
-    <455>   DW_AT_type        : (ref4) <0x8e9>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
-    <459>   DW_AT_data_member_location: (data1) 120
- <2><45a>: Abbrev Number: 9 (DW_TAG_member)
-    <45b>   DW_AT_name        : (strp) (offset: 0x52d): tp_call
-    <45f>   DW_AT_decl_file   : (data1) 11
-    <460>   DW_AT_decl_line   : (data1) 201
-    <461>   DW_AT_decl_column : (data1) 17
-    <462>   DW_AT_type        : (ref4) <0x6da>, ternaryfunc, PyObject, _object
-    <466>   DW_AT_data_member_location: (data1) 128
- <2><467>: Abbrev Number: 9 (DW_TAG_member)
-    <468>   DW_AT_name        : (strp) (offset: 0x565): tp_str
-    <46c>   DW_AT_decl_file   : (data1) 11
-    <46d>   DW_AT_decl_line   : (data1) 202
-    <46e>   DW_AT_decl_column : (data1) 14
-    <46f>   DW_AT_type        : (ref4) <0x8dd>, reprfunc, PyObject, _object
-    <473>   DW_AT_data_member_location: (data1) 136
- <2><474>: Abbrev Number: 9 (DW_TAG_member)
-    <475>   DW_AT_name        : (strp) (offset: 0x1045): tp_getattro
-    <479>   DW_AT_decl_file   : (data1) 11
-    <47a>   DW_AT_decl_line   : (data1) 203
-    <47b>   DW_AT_decl_column : (data1) 18
-    <47c>   DW_AT_type        : (ref4) <0x89a>, getattrofunc, PyObject, _object
-    <480>   DW_AT_data_member_location: (data1) 144
- <2><481>: Abbrev Number: 9 (DW_TAG_member)
-    <482>   DW_AT_name        : (strp) (offset: 0x15d1): tp_setattro
-    <486>   DW_AT_decl_file   : (data1) 11
-    <487>   DW_AT_decl_line   : (data1) 204
-    <488>   DW_AT_decl_column : (data1) 18
-    <489>   DW_AT_type        : (ref4) <0x8d1>, setattrofunc, int
-    <48d>   DW_AT_data_member_location: (data1) 152
- <2><48e>: Abbrev Number: 9 (DW_TAG_member)
-    <48f>   DW_AT_name        : (strp) (offset: 0xf30): tp_as_buffer
-    <493>   DW_AT_decl_file   : (data1) 11
-    <494>   DW_AT_decl_line   : (data1) 207
-    <495>   DW_AT_decl_column : (data1) 20
-    <496>   DW_AT_type        : (ref4) <0xe5c>, PyBufferProcs
-    <49a>   DW_AT_data_member_location: (data1) 160
- <2><49b>: Abbrev Number: 9 (DW_TAG_member)
-    <49c>   DW_AT_name        : (strp) (offset: 0x1a33): tp_flags
-    <4a0>   DW_AT_decl_file   : (data1) 11
-    <4a1>   DW_AT_decl_line   : (data1) 210
-    <4a2>   DW_AT_decl_column : (data1) 19
-    <4a3>   DW_AT_type        : (ref4) <0x35>, long unsigned int
-    <4a7>   DW_AT_data_member_location: (data1) 168
- <2><4a8>: Abbrev Number: 9 (DW_TAG_member)
-    <4a9>   DW_AT_name        : (strp) (offset: 0x12bb): tp_doc
-    <4ad>   DW_AT_decl_file   : (data1) 11
-    <4ae>   DW_AT_decl_line   : (data1) 212
-    <4af>   DW_AT_decl_column : (data1) 17
-    <4b0>   DW_AT_type        : (ref4) <0x2bf>, char
-    <4b4>   DW_AT_data_member_location: (data1) 176
- <2><4b5>: Abbrev Number: 9 (DW_TAG_member)
-    <4b6>   DW_AT_name        : (strp) (offset: 0x1533): tp_traverse
-    <4ba>   DW_AT_decl_file   : (data1) 11
-    <4bb>   DW_AT_decl_line   : (data1) 216
-    <4bc>   DW_AT_decl_column : (data1) 18
-    <4bd>   DW_AT_type        : (ref4) <0x80f>, traverseproc, int
-    <4c1>   DW_AT_data_member_location: (data1) 184
- <2><4c2>: Abbrev Number: 9 (DW_TAG_member)
-    <4c3>   DW_AT_name        : (strp) (offset: 0x7fb): tp_clear
-    <4c7>   DW_AT_decl_file   : (data1) 11
-    <4c8>   DW_AT_decl_line   : (data1) 219
-    <4c9>   DW_AT_decl_column : (data1) 13
-    <4ca>   DW_AT_type        : (ref4) <0x705>, inquiry, int
-    <4ce>   DW_AT_data_member_location: (data1) 192
- <2><4cf>: Abbrev Number: 9 (DW_TAG_member)
-    <4d0>   DW_AT_name        : (strp) (offset: 0x377): tp_richcompare
-    <4d4>   DW_AT_decl_file   : (data1) 11
-    <4d5>   DW_AT_decl_line   : (data1) 223
-    <4d6>   DW_AT_decl_column : (data1) 17
-    <4d7>   DW_AT_type        : (ref4) <0x90a>, richcmpfunc, PyObject, _object
-    <4db>   DW_AT_data_member_location: (data1) 200
- <2><4dc>: Abbrev Number: 9 (DW_TAG_member)
-    <4dd>   DW_AT_name        : (strp) (offset: 0x1248): tp_weaklistoffset
-    <4e1>   DW_AT_decl_file   : (data1) 11
-    <4e2>   DW_AT_decl_line   : (data1) 226
-    <4e3>   DW_AT_decl_column : (data1) 16
-    <4e4>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <4e8>   DW_AT_data_member_location: (data1) 208
- <2><4e9>: Abbrev Number: 9 (DW_TAG_member)
-    <4ea>   DW_AT_name        : (strp) (offset: 0x165e): tp_iter
-    <4ee>   DW_AT_decl_file   : (data1) 11
-    <4ef>   DW_AT_decl_line   : (data1) 229
-    <4f0>   DW_AT_decl_column : (data1) 17
-    <4f1>   DW_AT_type        : (ref4) <0x935>, getiterfunc, PyObject, _object
-    <4f5>   DW_AT_data_member_location: (data1) 216
- <2><4f6>: Abbrev Number: 9 (DW_TAG_member)
-    <4f7>   DW_AT_name        : (strp) (offset: 0x162b): tp_iternext
-    <4fb>   DW_AT_decl_file   : (data1) 11
-    <4fc>   DW_AT_decl_line   : (data1) 230
-    <4fd>   DW_AT_decl_column : (data1) 18
-    <4fe>   DW_AT_type        : (ref4) <0x941>, iternextfunc, PyObject, _object
-    <502>   DW_AT_data_member_location: (data1) 224
- <2><503>: Abbrev Number: 9 (DW_TAG_member)
-    <504>   DW_AT_name        : (strp) (offset: 0x107d): tp_methods
-    <508>   DW_AT_decl_file   : (data1) 11
-    <509>   DW_AT_decl_line   : (data1) 233
-    <50a>   DW_AT_decl_column : (data1) 25
-    <50b>   DW_AT_type        : (ref4) <0xea4>, PyMethodDef
-    <50f>   DW_AT_data_member_location: (data1) 232
- <2><510>: Abbrev Number: 9 (DW_TAG_member)
-    <511>   DW_AT_name        : (strp) (offset: 0x1512): tp_members
-    <515>   DW_AT_decl_file   : (data1) 11
-    <516>   DW_AT_decl_line   : (data1) 234
-    <517>   DW_AT_decl_column : (data1) 25
-    <518>   DW_AT_type        : (ref4) <0xeaf>, PyMemberDef
-    <51c>   DW_AT_data_member_location: (data1) 240
- <2><51d>: Abbrev Number: 9 (DW_TAG_member)
-    <51e>   DW_AT_name        : (strp) (offset: 0x1618): tp_getset
-    <522>   DW_AT_decl_file   : (data1) 11
-    <523>   DW_AT_decl_line   : (data1) 235
-    <524>   DW_AT_decl_column : (data1) 25
-    <525>   DW_AT_type        : (ref4) <0xf04>, PyGetSetDef
-    <529>   DW_AT_data_member_location: (data1) 248
- <2><52a>: Abbrev Number: 17 (DW_TAG_member)
-    <52b>   DW_AT_name        : (strp) (offset: 0x16ca): tp_base
-    <52f>   DW_AT_decl_file   : (data1) 11
-    <530>   DW_AT_decl_line   : (data1) 236
-    <531>   DW_AT_decl_column : (data1) 25
-    <532>   DW_AT_type        : (ref4) <0x646>, _typeobject
-    <536>   DW_AT_data_member_location: (data2) 256
- <2><538>: Abbrev Number: 17 (DW_TAG_member)
-    <539>   DW_AT_name        : (strp) (offset: 0x901): tp_dict
-    <53d>   DW_AT_decl_file   : (data1) 11
-    <53e>   DW_AT_decl_line   : (data1) 237
-    <53f>   DW_AT_decl_column : (data1) 15
-    <540>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <544>   DW_AT_data_member_location: (data2) 264
- <2><546>: Abbrev Number: 17 (DW_TAG_member)
-    <547>   DW_AT_name        : (strp) (offset: 0x1651): tp_descr_get
-    <54b>   DW_AT_decl_file   : (data1) 11
-    <54c>   DW_AT_decl_line   : (data1) 238
-    <54d>   DW_AT_decl_column : (data1) 18
-    <54e>   DW_AT_type        : (ref4) <0x94d>, descrgetfunc, PyObject, _object
-    <552>   DW_AT_data_member_location: (data2) 272
- <2><554>: Abbrev Number: 17 (DW_TAG_member)
-    <555>   DW_AT_name        : (strp) (offset: 0x1afc): tp_descr_set
-    <559>   DW_AT_decl_file   : (data1) 11
-    <55a>   DW_AT_decl_line   : (data1) 239
-    <55b>   DW_AT_decl_column : (data1) 18
-    <55c>   DW_AT_type        : (ref4) <0x959>, descrsetfunc, int
-    <560>   DW_AT_data_member_location: (data2) 280
- <2><562>: Abbrev Number: 17 (DW_TAG_member)
-    <563>   DW_AT_name        : (strp) (offset: 0x74c): tp_dictoffset
-    <567>   DW_AT_decl_file   : (data1) 11
-    <568>   DW_AT_decl_line   : (data1) 240
-    <569>   DW_AT_decl_column : (data1) 16
-    <56a>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <56e>   DW_AT_data_member_location: (data2) 288
- <2><570>: Abbrev Number: 17 (DW_TAG_member)
-    <571>   DW_AT_name        : (strp) (offset: 0x8ba): tp_init
-    <575>   DW_AT_decl_file   : (data1) 11
-    <576>   DW_AT_decl_line   : (data1) 241
-    <577>   DW_AT_decl_column : (data1) 14
-    <578>   DW_AT_type        : (ref4) <0x965>, initproc, int
-    <57c>   DW_AT_data_member_location: (data2) 296
- <2><57e>: Abbrev Number: 17 (DW_TAG_member)
-    <57f>   DW_AT_name        : (strp) (offset: 0xfa6): tp_alloc
-    <583>   DW_AT_decl_file   : (data1) 11
-    <584>   DW_AT_decl_line   : (data1) 242
-    <585>   DW_AT_decl_column : (data1) 15
-    <586>   DW_AT_type        : (ref4) <0x99c>, allocfunc, PyObject, _object
-    <58a>   DW_AT_data_member_location: (data2) 304
- <2><58c>: Abbrev Number: 17 (DW_TAG_member)
-    <58d>   DW_AT_name        : (strp) (offset: 0xde2): tp_new
-    <591>   DW_AT_decl_file   : (data1) 11
-    <592>   DW_AT_decl_line   : (data1) 243
-    <593>   DW_AT_decl_column : (data1) 13
-    <594>   DW_AT_type        : (ref4) <0x971>, newfunc, PyObject, _object
-    <598>   DW_AT_data_member_location: (data2) 312
- <2><59a>: Abbrev Number: 17 (DW_TAG_member)
-    <59b>   DW_AT_name        : (strp) (offset: 0x47e): tp_free
-    <59f>   DW_AT_decl_file   : (data1) 11
-    <5a0>   DW_AT_decl_line   : (data1) 244
-    <5a1>   DW_AT_decl_column : (data1) 14
-    <5a2>   DW_AT_type        : (ref4) <0x83a>, freefunc
-    <5a6>   DW_AT_data_member_location: (data2) 320
- <2><5a8>: Abbrev Number: 17 (DW_TAG_member)
-    <5a9>   DW_AT_name        : (strp) (offset: 0x154): tp_is_gc
-    <5ad>   DW_AT_decl_file   : (data1) 11
-    <5ae>   DW_AT_decl_line   : (data1) 245
-    <5af>   DW_AT_decl_column : (data1) 13
-    <5b0>   DW_AT_type        : (ref4) <0x705>, inquiry, int
-    <5b4>   DW_AT_data_member_location: (data2) 328
- <2><5b6>: Abbrev Number: 17 (DW_TAG_member)
-    <5b7>   DW_AT_name        : (strp) (offset: 0x235): tp_bases
-    <5bb>   DW_AT_decl_file   : (data1) 11
-    <5bc>   DW_AT_decl_line   : (data1) 246
-    <5bd>   DW_AT_decl_column : (data1) 15
-    <5be>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <5c2>   DW_AT_data_member_location: (data2) 336
- <2><5c4>: Abbrev Number: 17 (DW_TAG_member)
-    <5c5>   DW_AT_name        : (strp) (offset: 0x1097): tp_mro
-    <5c9>   DW_AT_decl_file   : (data1) 11
-    <5ca>   DW_AT_decl_line   : (data1) 247
-    <5cb>   DW_AT_decl_column : (data1) 15
-    <5cc>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <5d0>   DW_AT_data_member_location: (data2) 344
- <2><5d2>: Abbrev Number: 17 (DW_TAG_member)
-    <5d3>   DW_AT_name        : (strp) (offset: 0x1911): tp_cache
-    <5d7>   DW_AT_decl_file   : (data1) 11
-    <5d8>   DW_AT_decl_line   : (data1) 248
-    <5d9>   DW_AT_decl_column : (data1) 15
-    <5da>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <5de>   DW_AT_data_member_location: (data2) 352
- <2><5e0>: Abbrev Number: 17 (DW_TAG_member)
-    <5e1>   DW_AT_name        : (strp) (offset: 0x158f): tp_subclasses
-    <5e5>   DW_AT_decl_file   : (data1) 11
-    <5e6>   DW_AT_decl_line   : (data1) 249
-    <5e7>   DW_AT_decl_column : (data1) 15
-    <5e8>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <5ec>   DW_AT_data_member_location: (data2) 360
- <2><5ee>: Abbrev Number: 17 (DW_TAG_member)
-    <5ef>   DW_AT_name        : (strp) (offset: 0x133e): tp_weaklist
-    <5f3>   DW_AT_decl_file   : (data1) 11
-    <5f4>   DW_AT_decl_line   : (data1) 250
-    <5f5>   DW_AT_decl_column : (data1) 15
-    <5f6>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <5fa>   DW_AT_data_member_location: (data2) 368
- <2><5fc>: Abbrev Number: 17 (DW_TAG_member)
-    <5fd>   DW_AT_name        : (strp) (offset: 0xe9e): tp_del
-    <601>   DW_AT_decl_file   : (data1) 11
-    <602>   DW_AT_decl_line   : (data1) 251
-    <603>   DW_AT_decl_column : (data1) 16
-    <604>   DW_AT_type        : (ref4) <0x857>, destructor
-    <608>   DW_AT_data_member_location: (data2) 376
- <2><60a>: Abbrev Number: 17 (DW_TAG_member)
-    <60b>   DW_AT_name        : (strp) (offset: 0x1432): tp_version_tag
-    <60f>   DW_AT_decl_file   : (data1) 11
-    <610>   DW_AT_decl_line   : (data1) 254
-    <611>   DW_AT_decl_column : (data1) 18
-    <612>   DW_AT_type        : (ref4) <0x4a>, unsigned int
-    <616>   DW_AT_data_member_location: (data2) 384
- <2><618>: Abbrev Number: 18 (DW_TAG_member)
-    <619>   DW_AT_name        : (strp) (offset: 0x780): tp_finalize
-    <61d>   DW_AT_decl_file   : (data1) 11
-    <61e>   DW_AT_decl_line   : (data2) 256
-    <620>   DW_AT_decl_column : (data1) 16
-    <621>   DW_AT_type        : (ref4) <0x857>, destructor
-    <625>   DW_AT_data_member_location: (data2) 392
- <2><627>: Abbrev Number: 18 (DW_TAG_member)
-    <628>   DW_AT_name        : (strp) (offset: 0x1424): tp_vectorcall
-    <62c>   DW_AT_decl_file   : (data1) 11
-    <62d>   DW_AT_decl_line   : (data2) 257
-    <62f>   DW_AT_decl_column : (data1) 20
-    <630>   DW_AT_type        : (ref4) <0xadd>, vectorcallfunc, PyObject, _object
-    <634>   DW_AT_data_member_location: (data2) 400
- <2><636>: Abbrev Number: 18 (DW_TAG_member)
-    <637>   DW_AT_name        : (strp) (offset: 0x174c): tp_print
-    <63b>   DW_AT_decl_file   : (data1) 11
-    <63c>   DW_AT_decl_line   : (data2) 260
-    <63e>   DW_AT_decl_column : (data1) 30
-    <63f>   DW_AT_type        : (ref4) <0xf29>, int
-    <643>   DW_AT_data_member_location: (data2) 408
- <2><645>: Abbrev Number: 0
- <1><646>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <647>   DW_AT_byte_size   : (data1) 8
-    <648>   DW_AT_type        : (ref4) <0x396>, _typeobject
- <1><64c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <64d>   DW_AT_name        : (strp) (offset: 0xc48): PyObject
-    <651>   DW_AT_decl_file   : (data1) 2
-    <652>   DW_AT_decl_line   : (data1) 108
-    <653>   DW_AT_decl_column : (data1) 3
-    <654>   DW_AT_type        : (ref4) <0x36e>, _object
- <1><658>: Abbrev Number: 19 (DW_TAG_structure_type)
-    <659>   DW_AT_byte_size   : (data1) 24
-    <65a>   DW_AT_decl_file   : (data1) 2
-    <65b>   DW_AT_decl_line   : (data1) 113
-    <65c>   DW_AT_decl_column : (data1) 9
-    <65d>   DW_AT_sibling     : (ref4) <0x67c>
- <2><661>: Abbrev Number: 9 (DW_TAG_member)
-    <662>   DW_AT_name        : (strp) (offset: 0x5b9): ob_base
-    <666>   DW_AT_decl_file   : (data1) 2
-    <667>   DW_AT_decl_line   : (data1) 114
-    <668>   DW_AT_decl_column : (data1) 14
-    <669>   DW_AT_type        : (ref4) <0x64c>, PyObject, _object
-    <66d>   DW_AT_data_member_location: (data1) 0
- <2><66e>: Abbrev Number: 9 (DW_TAG_member)
-    <66f>   DW_AT_name        : (strp) (offset: 0x8e0): ob_size
-    <673>   DW_AT_decl_file   : (data1) 2
-    <674>   DW_AT_decl_line   : (data1) 115
-    <675>   DW_AT_decl_column : (data1) 16
-    <676>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <67a>   DW_AT_data_member_location: (data1) 16
- <2><67b>: Abbrev Number: 0
- <1><67c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <67d>   DW_AT_name        : (strp) (offset: 0x4d5): PyVarObject
-    <681>   DW_AT_decl_file   : (data1) 2
-    <682>   DW_AT_decl_line   : (data1) 116
-    <683>   DW_AT_decl_column : (data1) 3
-    <684>   DW_AT_type        : (ref4) <0x658>
- <1><688>: Abbrev Number: 2 (DW_TAG_typedef)
-    <689>   DW_AT_name        : (strp) (offset: 0x10f5): unaryfunc
-    <68d>   DW_AT_decl_file   : (data1) 2
-    <68e>   DW_AT_decl_line   : (data1) 140
-    <68f>   DW_AT_decl_column : (data1) 22
-    <690>   DW_AT_type        : (ref4) <0x694>, PyObject, _object
- <1><694>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <695>   DW_AT_byte_size   : (data1) 8
-    <696>   DW_AT_type        : (ref4) <0x69a>, PyObject, _object
- <1><69a>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <69b>   DW_AT_prototyped  : (flag_present) 1
-    <69b>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <69f>   DW_AT_sibling     : (ref4) <0x6a9>
- <2><6a3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <6a4>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><6a8>: Abbrev Number: 0
- <1><6a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <6aa>   DW_AT_byte_size   : (data1) 8
-    <6ab>   DW_AT_type        : (ref4) <0x64c>, PyObject, _object
- <1><6af>: Abbrev Number: 7 (DW_TAG_const_type)
-    <6b0>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <1><6b4>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6b5>   DW_AT_name        : (strp) (offset: 0x9ab): binaryfunc
-    <6b9>   DW_AT_decl_file   : (data1) 2
-    <6ba>   DW_AT_decl_line   : (data1) 141
-    <6bb>   DW_AT_decl_column : (data1) 22
-    <6bc>   DW_AT_type        : (ref4) <0x6c0>, PyObject, _object
- <1><6c0>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <6c1>   DW_AT_byte_size   : (data1) 8
-    <6c2>   DW_AT_type        : (ref4) <0x6c6>, PyObject, _object
- <1><6c6>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <6c7>   DW_AT_prototyped  : (flag_present) 1
-    <6c7>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <6cb>   DW_AT_sibling     : (ref4) <0x6da>
- <2><6cf>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <6d0>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><6d4>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <6d5>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><6d9>: Abbrev Number: 0
- <1><6da>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6db>   DW_AT_name        : (strp) (offset: 0x5ad): ternaryfunc
-    <6df>   DW_AT_decl_file   : (data1) 2
-    <6e0>   DW_AT_decl_line   : (data1) 142
-    <6e1>   DW_AT_decl_column : (data1) 22
-    <6e2>   DW_AT_type        : (ref4) <0x6e6>, PyObject, _object
- <1><6e6>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <6e7>   DW_AT_byte_size   : (data1) 8
-    <6e8>   DW_AT_type        : (ref4) <0x6ec>, PyObject, _object
- <1><6ec>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <6ed>   DW_AT_prototyped  : (flag_present) 1
-    <6ed>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <6f1>   DW_AT_sibling     : (ref4) <0x705>
- <2><6f5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <6f6>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><6fa>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <6fb>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><6ff>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <700>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><704>: Abbrev Number: 0
- <1><705>: Abbrev Number: 2 (DW_TAG_typedef)
-    <706>   DW_AT_name        : (strp) (offset: 0x11b6): inquiry
-    <70a>   DW_AT_decl_file   : (data1) 2
-    <70b>   DW_AT_decl_line   : (data1) 143
-    <70c>   DW_AT_decl_column : (data1) 15
-    <70d>   DW_AT_type        : (ref4) <0x711>, int
- <1><711>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <712>   DW_AT_byte_size   : (data1) 8
-    <713>   DW_AT_type        : (ref4) <0x717>, int
- <1><717>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <718>   DW_AT_prototyped  : (flag_present) 1
-    <718>   DW_AT_type        : (ref4) <0x5f>, int
-    <71c>   DW_AT_sibling     : (ref4) <0x726>
- <2><720>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <721>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><725>: Abbrev Number: 0
- <1><726>: Abbrev Number: 2 (DW_TAG_typedef)
-    <727>   DW_AT_name        : (strp) (offset: 0x37): lenfunc
-    <72b>   DW_AT_decl_file   : (data1) 2
-    <72c>   DW_AT_decl_line   : (data1) 144
-    <72d>   DW_AT_decl_column : (data1) 22
-    <72e>   DW_AT_type        : (ref4) <0x732>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><732>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <733>   DW_AT_byte_size   : (data1) 8
-    <734>   DW_AT_type        : (ref4) <0x738>, Py_ssize_t, ssize_t, __ssize_t, long int
- <1><738>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <739>   DW_AT_prototyped  : (flag_present) 1
-    <739>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
-    <73d>   DW_AT_sibling     : (ref4) <0x747>
- <2><741>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <742>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><746>: Abbrev Number: 0
- <1><747>: Abbrev Number: 2 (DW_TAG_typedef)
-    <748>   DW_AT_name        : (strp) (offset: 0xa65): ssizeargfunc
-    <74c>   DW_AT_decl_file   : (data1) 2
-    <74d>   DW_AT_decl_line   : (data1) 145
-    <74e>   DW_AT_decl_column : (data1) 21
-    <74f>   DW_AT_type        : (ref4) <0x753>, PyObject, _object
- <1><753>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <754>   DW_AT_byte_size   : (data1) 8
-    <755>   DW_AT_type        : (ref4) <0x759>, PyObject, _object
- <1><759>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <75a>   DW_AT_prototyped  : (flag_present) 1
-    <75a>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <75e>   DW_AT_sibling     : (ref4) <0x76d>
- <2><762>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <763>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><767>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <768>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
- <2><76c>: Abbrev Number: 0
- <1><76d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <76e>   DW_AT_name        : (strp) (offset: 0x1414): ssizeobjargproc
-    <772>   DW_AT_decl_file   : (data1) 2
-    <773>   DW_AT_decl_line   : (data1) 147
-    <774>   DW_AT_decl_column : (data1) 14
-    <775>   DW_AT_type        : (ref4) <0x779>, int
- <1><779>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <77a>   DW_AT_byte_size   : (data1) 8
-    <77b>   DW_AT_type        : (ref4) <0x77f>, int
- <1><77f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <780>   DW_AT_prototyped  : (flag_present) 1
-    <780>   DW_AT_type        : (ref4) <0x5f>, int
-    <784>   DW_AT_sibling     : (ref4) <0x798>
- <2><788>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <789>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><78d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <78e>   DW_AT_type        : (ref4) <0x310>, Py_ssize_t, ssize_t, __ssize_t, long int
- <2><792>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <793>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><797>: Abbrev Number: 0
- <1><798>: Abbrev Number: 2 (DW_TAG_typedef)
-    <799>   DW_AT_name        : (strp) (offset: 0x8d2): objobjargproc
-    <79d>   DW_AT_decl_file   : (data1) 2
-    <79e>   DW_AT_decl_line   : (data1) 149
-    <79f>   DW_AT_decl_column : (data1) 14
-    <7a0>   DW_AT_type        : (ref4) <0x7a4>, int
- <1><7a4>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <7a5>   DW_AT_byte_size   : (data1) 8
-    <7a6>   DW_AT_type        : (ref4) <0x7aa>, int
- <1><7aa>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <7ab>   DW_AT_prototyped  : (flag_present) 1
-    <7ab>   DW_AT_type        : (ref4) <0x5f>, int
-    <7af>   DW_AT_sibling     : (ref4) <0x7c3>
- <2><7b3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <7b4>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><7b8>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <7b9>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><7bd>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <7be>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><7c2>: Abbrev Number: 0
- <1><7c3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7c4>   DW_AT_name        : (strp) (offset: 0x1be5): objobjproc
-    <7c8>   DW_AT_decl_file   : (data1) 2
-    <7c9>   DW_AT_decl_line   : (data1) 151
-    <7ca>   DW_AT_decl_column : (data1) 15
-    <7cb>   DW_AT_type        : (ref4) <0x7cf>, int
- <1><7cf>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <7d0>   DW_AT_byte_size   : (data1) 8
-    <7d1>   DW_AT_type        : (ref4) <0x7d5>, int
- <1><7d5>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <7d6>   DW_AT_prototyped  : (flag_present) 1
-    <7d6>   DW_AT_type        : (ref4) <0x5f>, int
-    <7da>   DW_AT_sibling     : (ref4) <0x7e9>
- <2><7de>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <7df>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><7e3>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <7e4>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><7e8>: Abbrev Number: 0
- <1><7e9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7ea>   DW_AT_name        : (strp) (offset: 0x3c2): visitproc
-    <7ee>   DW_AT_decl_file   : (data1) 2
-    <7ef>   DW_AT_decl_line   : (data1) 152
-    <7f0>   DW_AT_decl_column : (data1) 15
-    <7f1>   DW_AT_type        : (ref4) <0x7f5>, int
- <1><7f5>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <7f6>   DW_AT_byte_size   : (data1) 8
-    <7f7>   DW_AT_type        : (ref4) <0x7fb>, int
- <1><7fb>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <7fc>   DW_AT_prototyped  : (flag_present) 1
-    <7fc>   DW_AT_type        : (ref4) <0x5f>, int
-    <800>   DW_AT_sibling     : (ref4) <0x80f>
- <2><804>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <805>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><809>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <80a>   DW_AT_type        : (ref4) <0x85>
- <2><80e>: Abbrev Number: 0
- <1><80f>: Abbrev Number: 2 (DW_TAG_typedef)
-    <810>   DW_AT_name        : (strp) (offset: 0x1169): traverseproc
-    <814>   DW_AT_decl_file   : (data1) 2
-    <815>   DW_AT_decl_line   : (data1) 153
-    <816>   DW_AT_decl_column : (data1) 15
-    <817>   DW_AT_type        : (ref4) <0x81b>, int
- <1><81b>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <81c>   DW_AT_byte_size   : (data1) 8
-    <81d>   DW_AT_type        : (ref4) <0x821>, int
- <1><821>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <822>   DW_AT_prototyped  : (flag_present) 1
-    <822>   DW_AT_type        : (ref4) <0x5f>, int
-    <826>   DW_AT_sibling     : (ref4) <0x83a>
- <2><82a>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <82b>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><82f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <830>   DW_AT_type        : (ref4) <0x7e9>, visitproc, int
- <2><834>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <835>   DW_AT_type        : (ref4) <0x85>
- <2><839>: Abbrev Number: 0
- <1><83a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <83b>   DW_AT_name        : (strp) (offset: 0x15dd): freefunc
-    <83f>   DW_AT_decl_file   : (data1) 2
-    <840>   DW_AT_decl_line   : (data1) 156
-    <841>   DW_AT_decl_column : (data1) 16
-    <842>   DW_AT_type        : (ref4) <0x846>
- <1><846>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <847>   DW_AT_byte_size   : (data1) 8
-    <848>   DW_AT_type        : (ref4) <0x84c>
- <1><84c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <84d>   DW_AT_prototyped  : (flag_present) 1
-    <84d>   DW_AT_sibling     : (ref4) <0x857>
- <2><851>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <852>   DW_AT_type        : (ref4) <0x85>
- <2><856>: Abbrev Number: 0
- <1><857>: Abbrev Number: 2 (DW_TAG_typedef)
-    <858>   DW_AT_name        : (strp) (offset: 0xe4a): destructor
-    <85c>   DW_AT_decl_file   : (data1) 2
-    <85d>   DW_AT_decl_line   : (data1) 157
-    <85e>   DW_AT_decl_column : (data1) 16
-    <85f>   DW_AT_type        : (ref4) <0x863>
- <1><863>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <864>   DW_AT_byte_size   : (data1) 8
-    <865>   DW_AT_type        : (ref4) <0x869>
- <1><869>: Abbrev Number: 22 (DW_TAG_subroutine_type)
-    <86a>   DW_AT_prototyped  : (flag_present) 1
-    <86a>   DW_AT_sibling     : (ref4) <0x874>
- <2><86e>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <86f>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><873>: Abbrev Number: 0
- <1><874>: Abbrev Number: 2 (DW_TAG_typedef)
-    <875>   DW_AT_name        : (strp) (offset: 0x1392): getattrfunc
-    <879>   DW_AT_decl_file   : (data1) 2
-    <87a>   DW_AT_decl_line   : (data1) 158
-    <87b>   DW_AT_decl_column : (data1) 21
-    <87c>   DW_AT_type        : (ref4) <0x880>, PyObject, _object
- <1><880>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <881>   DW_AT_byte_size   : (data1) 8
-    <882>   DW_AT_type        : (ref4) <0x886>, PyObject, _object
- <1><886>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <887>   DW_AT_prototyped  : (flag_present) 1
-    <887>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
-    <88b>   DW_AT_sibling     : (ref4) <0x89a>
- <2><88f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <890>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><894>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <895>   DW_AT_type        : (ref4) <0x93>, char
- <2><899>: Abbrev Number: 0
- <1><89a>: Abbrev Number: 2 (DW_TAG_typedef)
-    <89b>   DW_AT_name        : (strp) (offset: 0x12c2): getattrofunc
-    <89f>   DW_AT_decl_file   : (data1) 2
-    <8a0>   DW_AT_decl_line   : (data1) 159
-    <8a1>   DW_AT_decl_column : (data1) 21
-    <8a2>   DW_AT_type        : (ref4) <0x6c0>, PyObject, _object
- <1><8a6>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8a7>   DW_AT_name        : (strp) (offset: 0x941): setattrfunc
-    <8ab>   DW_AT_decl_file   : (data1) 2
-    <8ac>   DW_AT_decl_line   : (data1) 160
-    <8ad>   DW_AT_decl_column : (data1) 15
-    <8ae>   DW_AT_type        : (ref4) <0x8b2>, int
- <1><8b2>: Abbrev Number: 6 (DW_TAG_pointer_type)
-    <8b3>   DW_AT_byte_size   : (data1) 8
-    <8b4>   DW_AT_type        : (ref4) <0x8b8>, int
- <1><8b8>: Abbrev Number: 20 (DW_TAG_subroutine_type)
-    <8b9>   DW_AT_prototyped  : (flag_present) 1
-    <8b9>   DW_AT_type        : (ref4) <0x5f>, int
-    <8bd>   DW_AT_sibling     : (ref4) <0x8d1>
- <2><8c1>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <8c2>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><8c6>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <8c7>   DW_AT_type        : (ref4) <0x93>, char
- <2><8cb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
-    <8cc>   DW_AT_type        : (ref4) <0x6a9>, PyObject, _object
- <2><8d0>: Abbrev Number: 0
- <1><8d1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8d2>   DW_AT_name        : (strp) (offset: 0x27c): setattrofunc
-    <8d6>   DW_AT_decl_file   : (data1) 2
-    <8d7>   DW_AT_decl_line   : (data1) 161
-    <8d8>   DW_AT_decl_column : (data1) 15
-    <8d9>   DW_AT_type        : (ref4) <0x7a4>, int
- <1><8dd>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8de>   DW_AT_name        : (strp) (offset: 0xb62): reprfunc
-    <8e2>   DW_AT_decl_file   : (data1) 2
-    <8e3>   DW_AT_decl_line   : (data1) 162
-    <8e4>   DW_AT_decl_column : (data1) 21
-    <8e5>   DW_AT_type        : (ref4) <0x694>, PyObject, _object
+    <311>   DW_AT_name        : (strp) (offset: 0x13d8): uint32_t
+    <315>   DW_AT_decl_file   : (data1) 8
+    <316>   DW_AT_decl_line   : (data1) 51
+    <317>   DW_AT_decl_column : (data1) 23
+    <318>   DW_AT_type        : (ref4) <0x4a>, unsigned int
+ <1><31c>: Abbrev Number: 2 (DW_TAG_typedef)
+    <31d>   DW_AT_name        : (strp) (offset: 0x89a): uint64_t
+    <321>   DW_AT_decl_file   : (data1) 8
+    <322>   DW_AT_decl_line   : (data1) 55
+    <323>   DW_AT_decl_column : (data1) 27
+    <324>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+ <1><328>: Abbrev Number: 2 (DW_TAG_typedef)
+    <329>   DW_AT_name        : (strp) (offset: 0x1c1b): Py_ssize_t
+    <32d>   DW_AT_decl_file   : (data1) 9
+    <32e>   DW_AT_decl_line   : (data1) 105
+    <32f>   DW_AT_decl_column : (data1) 25
+    <330>   DW_AT_type        : (ref4) <0x2c5>, ssize_t, __ssize_t, long int
+ <1><334>: Abbrev Number: 7 (DW_TAG_const_type)
+    <335>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><339>: Abbrev Number: 2 (DW_TAG_typedef)
+    <33a>   DW_AT_name        : (strp) (offset: 0xd8b): Py_hash_t
+    <33e>   DW_AT_decl_file   : (data1) 9
+    <33f>   DW_AT_decl_line   : (data1) 114
+    <340>   DW_AT_decl_column : (data1) 20
+    <341>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><345>: Abbrev Number: 3 (DW_TAG_base_type)
+    <346>   DW_AT_byte_size   : (data1) 4
+    <347>   DW_AT_encoding    : (data1) 4	(float)
+    <348>   DW_AT_name        : (strp) (offset: 0x1370): float
+ <1><34c>: Abbrev Number: 3 (DW_TAG_base_type)
+    <34d>   DW_AT_byte_size   : (data1) 8
+    <34e>   DW_AT_encoding    : (data1) 4	(float)
+    <34f>   DW_AT_name        : (strp) (offset: 0x349): double
+ <1><353>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <354>   DW_AT_name        : (strp) (offset: 0x1bdb): timezone
+    <358>   DW_AT_byte_size   : (data1) 8
+    <359>   DW_AT_decl_file   : (data1) 10
+    <35a>   DW_AT_decl_line   : (data1) 56
+    <35b>   DW_AT_decl_column : (data1) 8
+    <35c>   DW_AT_sibling     : (ref4) <0x37b>
+ <2><360>: Abbrev Number: 9 (DW_TAG_member)
+    <361>   DW_AT_name        : (strp) (offset: 0x1f0a): tz_minuteswest
+    <365>   DW_AT_decl_file   : (data1) 10
+    <366>   DW_AT_decl_line   : (data1) 58
+    <367>   DW_AT_decl_column : (data1) 9
+    <368>   DW_AT_type        : (ref4) <0x5f>, int
+    <36c>   DW_AT_data_member_location: (data1) 0
+ <2><36d>: Abbrev Number: 9 (DW_TAG_member)
+    <36e>   DW_AT_name        : (strp) (offset: 0x12ab): tz_dsttime
+    <372>   DW_AT_decl_file   : (data1) 10
+    <373>   DW_AT_decl_line   : (data1) 59
+    <374>   DW_AT_decl_column : (data1) 9
+    <375>   DW_AT_type        : (ref4) <0x5f>, int
+    <379>   DW_AT_data_member_location: (data1) 4
+ <2><37a>: Abbrev Number: 0
+ <1><37b>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <37c>   DW_AT_byte_size   : (data1) 8
+    <37d>   DW_AT_type        : (ref4) <0x353>, timezone
+ <1><381>: Abbrev Number: 15 (DW_TAG_restrict_type)
+    <382>   DW_AT_type        : (ref4) <0x37b>, timezone
+ <1><386>: Abbrev Number: 8 (DW_TAG_structure_type)
+    <387>   DW_AT_name        : (strp) (offset: 0x47d): _object
+    <38b>   DW_AT_byte_size   : (data1) 16
+    <38c>   DW_AT_decl_file   : (data1) 2
+    <38d>   DW_AT_decl_line   : (data1) 104
+    <38e>   DW_AT_decl_column : (data1) 16
+    <38f>   DW_AT_sibling     : (ref4) <0x3ae>
+ <2><393>: Abbrev Number: 9 (DW_TAG_member)
+    <394>   DW_AT_name        : (strp) (offset: 0xfa): ob_refcnt
+    <398>   DW_AT_decl_file   : (data1) 2
+    <399>   DW_AT_decl_line   : (data1) 106
+    <39a>   DW_AT_decl_column : (data1) 16
+    <39b>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <39f>   DW_AT_data_member_location: (data1) 0
+ <2><3a0>: Abbrev Number: 9 (DW_TAG_member)
+    <3a1>   DW_AT_name        : (strp) (offset: 0x4d2): ob_type
+    <3a5>   DW_AT_decl_file   : (data1) 2
+    <3a6>   DW_AT_decl_line   : (data1) 107
+    <3a7>   DW_AT_decl_column : (data1) 25
+    <3a8>   DW_AT_type        : (ref4) <0x65e>, _typeobject
+    <3ac>   DW_AT_data_member_location: (data1) 8
+ <2><3ad>: Abbrev Number: 0
+ <1><3ae>: Abbrev Number: 16 (DW_TAG_structure_type)
+    <3af>   DW_AT_name        : (strp) (offset: 0x2ef): _typeobject
+    <3b3>   DW_AT_byte_size   : (data2) 416
+    <3b5>   DW_AT_decl_file   : (data1) 11
+    <3b6>   DW_AT_decl_line   : (data1) 177
+    <3b7>   DW_AT_decl_column : (data1) 16
+    <3b8>   DW_AT_sibling     : (ref4) <0x65e>
+ <2><3bc>: Abbrev Number: 9 (DW_TAG_member)
+    <3bd>   DW_AT_name        : (strp) (offset: 0x62c): ob_base
+    <3c1>   DW_AT_decl_file   : (data1) 11
+    <3c2>   DW_AT_decl_line   : (data1) 178
+    <3c3>   DW_AT_decl_column : (data1) 5
+    <3c4>   DW_AT_type        : (ref4) <0x694>, PyVarObject
+    <3c8>   DW_AT_data_member_location: (data1) 0
+ <2><3c9>: Abbrev Number: 9 (DW_TAG_member)
+    <3ca>   DW_AT_name        : (strp) (offset: 0x10a8): tp_name
+    <3ce>   DW_AT_decl_file   : (data1) 11
+    <3cf>   DW_AT_decl_line   : (data1) 179
+    <3d0>   DW_AT_decl_column : (data1) 17
+    <3d1>   DW_AT_type        : (ref4) <0x2bf>, char
+    <3d5>   DW_AT_data_member_location: (data1) 24
+ <2><3d6>: Abbrev Number: 9 (DW_TAG_member)
+    <3d7>   DW_AT_name        : (strp) (offset: 0x1e9e): tp_basicsize
+    <3db>   DW_AT_decl_file   : (data1) 11
+    <3dc>   DW_AT_decl_line   : (data1) 180
+    <3dd>   DW_AT_decl_column : (data1) 16
+    <3de>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3e2>   DW_AT_data_member_location: (data1) 32
+ <2><3e3>: Abbrev Number: 9 (DW_TAG_member)
+    <3e4>   DW_AT_name        : (strp) (offset: 0x20b): tp_itemsize
+    <3e8>   DW_AT_decl_file   : (data1) 11
+    <3e9>   DW_AT_decl_line   : (data1) 180
+    <3ea>   DW_AT_decl_column : (data1) 30
+    <3eb>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <3ef>   DW_AT_data_member_location: (data1) 40
+ <2><3f0>: Abbrev Number: 9 (DW_TAG_member)
+    <3f1>   DW_AT_name        : (strp) (offset: 0x2e4): tp_dealloc
+    <3f5>   DW_AT_decl_file   : (data1) 11
+    <3f6>   DW_AT_decl_line   : (data1) 184
+    <3f7>   DW_AT_decl_column : (data1) 16
+    <3f8>   DW_AT_type        : (ref4) <0x86f>, destructor
+    <3fc>   DW_AT_data_member_location: (data1) 48
+ <2><3fd>: Abbrev Number: 9 (DW_TAG_member)
+    <3fe>   DW_AT_name        : (strp) (offset: 0x13bb): tp_vectorcall_offset
+    <402>   DW_AT_decl_file   : (data1) 11
+    <403>   DW_AT_decl_line   : (data1) 185
+    <404>   DW_AT_decl_column : (data1) 16
+    <405>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <409>   DW_AT_data_member_location: (data1) 56
+ <2><40a>: Abbrev Number: 9 (DW_TAG_member)
+    <40b>   DW_AT_name        : (strp) (offset: 0xae): tp_getattr
+    <40f>   DW_AT_decl_file   : (data1) 11
+    <410>   DW_AT_decl_line   : (data1) 186
+    <411>   DW_AT_decl_column : (data1) 17
+    <412>   DW_AT_type        : (ref4) <0x88c>, getattrfunc, PyObject, _object
+    <416>   DW_AT_data_member_location: (data1) 64
+ <2><417>: Abbrev Number: 9 (DW_TAG_member)
+    <418>   DW_AT_name        : (strp) (offset: 0x72c): tp_setattr
+    <41c>   DW_AT_decl_file   : (data1) 11
+    <41d>   DW_AT_decl_line   : (data1) 187
+    <41e>   DW_AT_decl_column : (data1) 17
+    <41f>   DW_AT_type        : (ref4) <0x8be>, setattrfunc, int
+    <423>   DW_AT_data_member_location: (data1) 72
+ <2><424>: Abbrev Number: 9 (DW_TAG_member)
+    <425>   DW_AT_name        : (strp) (offset: 0x140): tp_as_async
+    <429>   DW_AT_decl_file   : (data1) 11
+    <42a>   DW_AT_decl_line   : (data1) 188
+    <42b>   DW_AT_decl_column : (data1) 21
+    <42c>   DW_AT_type        : (ref4) <0xe5c>, PyAsyncMethods
+    <430>   DW_AT_data_member_location: (data1) 80
+ <2><431>: Abbrev Number: 9 (DW_TAG_member)
+    <432>   DW_AT_name        : (strp) (offset: 0x1be4): tp_repr
+    <436>   DW_AT_decl_file   : (data1) 11
+    <437>   DW_AT_decl_line   : (data1) 190
+    <438>   DW_AT_decl_column : (data1) 14
+    <439>   DW_AT_type        : (ref4) <0x8f5>, reprfunc, PyObject, _object
+    <43d>   DW_AT_data_member_location: (data1) 88
+ <2><43e>: Abbrev Number: 9 (DW_TAG_member)
+    <43f>   DW_AT_name        : (strp) (offset: 0x1433): tp_as_number
+    <443>   DW_AT_decl_file   : (data1) 11
+    <444>   DW_AT_decl_line   : (data1) 194
+    <445>   DW_AT_decl_column : (data1) 22
+    <446>   DW_AT_type        : (ref4) <0xe62>, PyNumberMethods
+    <44a>   DW_AT_data_member_location: (data1) 96
+ <2><44b>: Abbrev Number: 9 (DW_TAG_member)
+    <44c>   DW_AT_name        : (strp) (offset: 0x1102): tp_as_sequence
+    <450>   DW_AT_decl_file   : (data1) 11
+    <451>   DW_AT_decl_line   : (data1) 195
+    <452>   DW_AT_decl_column : (data1) 24
+    <453>   DW_AT_type        : (ref4) <0xe68>, PySequenceMethods
+    <457>   DW_AT_data_member_location: (data1) 104
+ <2><458>: Abbrev Number: 9 (DW_TAG_member)
+    <459>   DW_AT_name        : (strp) (offset: 0x9f8): tp_as_mapping
+    <45d>   DW_AT_decl_file   : (data1) 11
+    <45e>   DW_AT_decl_line   : (data1) 196
+    <45f>   DW_AT_decl_column : (data1) 23
+    <460>   DW_AT_type        : (ref4) <0xe6e>, PyMappingMethods
+    <464>   DW_AT_data_member_location: (data1) 112
+ <2><465>: Abbrev Number: 9 (DW_TAG_member)
+    <466>   DW_AT_name        : (strp) (offset: 0x1696): tp_hash
+    <46a>   DW_AT_decl_file   : (data1) 11
+    <46b>   DW_AT_decl_line   : (data1) 200
+    <46c>   DW_AT_decl_column : (data1) 14
+    <46d>   DW_AT_type        : (ref4) <0x901>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
+    <471>   DW_AT_data_member_location: (data1) 120
+ <2><472>: Abbrev Number: 9 (DW_TAG_member)
+    <473>   DW_AT_name        : (strp) (offset: 0x5a0): tp_call
+    <477>   DW_AT_decl_file   : (data1) 11
+    <478>   DW_AT_decl_line   : (data1) 201
+    <479>   DW_AT_decl_column : (data1) 17
+    <47a>   DW_AT_type        : (ref4) <0x6f2>, ternaryfunc, PyObject, _object
+    <47e>   DW_AT_data_member_location: (data1) 128
+ <2><47f>: Abbrev Number: 9 (DW_TAG_member)
+    <480>   DW_AT_name        : (strp) (offset: 0x5d8): tp_str
+    <484>   DW_AT_decl_file   : (data1) 11
+    <485>   DW_AT_decl_line   : (data1) 202
+    <486>   DW_AT_decl_column : (data1) 14
+    <487>   DW_AT_type        : (ref4) <0x8f5>, reprfunc, PyObject, _object
+    <48b>   DW_AT_data_member_location: (data1) 136
+ <2><48c>: Abbrev Number: 9 (DW_TAG_member)
+    <48d>   DW_AT_name        : (strp) (offset: 0x1248): tp_getattro
+    <491>   DW_AT_decl_file   : (data1) 11
+    <492>   DW_AT_decl_line   : (data1) 203
+    <493>   DW_AT_decl_column : (data1) 18
+    <494>   DW_AT_type        : (ref4) <0x8b2>, getattrofunc, PyObject, _object
+    <498>   DW_AT_data_member_location: (data1) 144
+ <2><499>: Abbrev Number: 9 (DW_TAG_member)
+    <49a>   DW_AT_name        : (strp) (offset: 0x189a): tp_setattro
+    <49e>   DW_AT_decl_file   : (data1) 11
+    <49f>   DW_AT_decl_line   : (data1) 204
+    <4a0>   DW_AT_decl_column : (data1) 18
+    <4a1>   DW_AT_type        : (ref4) <0x8e9>, setattrofunc, int
+    <4a5>   DW_AT_data_member_location: (data1) 152
+ <2><4a6>: Abbrev Number: 9 (DW_TAG_member)
+    <4a7>   DW_AT_name        : (strp) (offset: 0x1129): tp_as_buffer
+    <4ab>   DW_AT_decl_file   : (data1) 11
+    <4ac>   DW_AT_decl_line   : (data1) 207
+    <4ad>   DW_AT_decl_column : (data1) 20
+    <4ae>   DW_AT_type        : (ref4) <0xe74>, PyBufferProcs
+    <4b2>   DW_AT_data_member_location: (data1) 160
+ <2><4b3>: Abbrev Number: 9 (DW_TAG_member)
+    <4b4>   DW_AT_name        : (strp) (offset: 0x1d3c): tp_flags
+    <4b8>   DW_AT_decl_file   : (data1) 11
+    <4b9>   DW_AT_decl_line   : (data1) 210
+    <4ba>   DW_AT_decl_column : (data1) 19
+    <4bb>   DW_AT_type        : (ref4) <0x35>, long unsigned int
+    <4bf>   DW_AT_data_member_location: (data1) 168
+ <2><4c0>: Abbrev Number: 9 (DW_TAG_member)
+    <4c1>   DW_AT_name        : (strp) (offset: 0x14f3): tp_doc
+    <4c5>   DW_AT_decl_file   : (data1) 11
+    <4c6>   DW_AT_decl_line   : (data1) 212
+    <4c7>   DW_AT_decl_column : (data1) 17
+    <4c8>   DW_AT_type        : (ref4) <0x2bf>, char
+    <4cc>   DW_AT_data_member_location: (data1) 176
+ <2><4cd>: Abbrev Number: 9 (DW_TAG_member)
+    <4ce>   DW_AT_name        : (strp) (offset: 0x17fc): tp_traverse
+    <4d2>   DW_AT_decl_file   : (data1) 11
+    <4d3>   DW_AT_decl_line   : (data1) 216
+    <4d4>   DW_AT_decl_column : (data1) 18
+    <4d5>   DW_AT_type        : (ref4) <0x827>, traverseproc, int
+    <4d9>   DW_AT_data_member_location: (data1) 184
+ <2><4da>: Abbrev Number: 9 (DW_TAG_member)
+    <4db>   DW_AT_name        : (strp) (offset: 0x885): tp_clear
+    <4df>   DW_AT_decl_file   : (data1) 11
+    <4e0>   DW_AT_decl_line   : (data1) 219
+    <4e1>   DW_AT_decl_column : (data1) 13
+    <4e2>   DW_AT_type        : (ref4) <0x71d>, inquiry, int
+    <4e6>   DW_AT_data_member_location: (data1) 192
+ <2><4e7>: Abbrev Number: 9 (DW_TAG_member)
+    <4e8>   DW_AT_name        : (strp) (offset: 0x3bb): tp_richcompare
+    <4ec>   DW_AT_decl_file   : (data1) 11
+    <4ed>   DW_AT_decl_line   : (data1) 223
+    <4ee>   DW_AT_decl_column : (data1) 17
+    <4ef>   DW_AT_type        : (ref4) <0x922>, richcmpfunc, PyObject, _object
+    <4f3>   DW_AT_data_member_location: (data1) 200
+ <2><4f4>: Abbrev Number: 9 (DW_TAG_member)
+    <4f5>   DW_AT_name        : (strp) (offset: 0x146b): tp_weaklistoffset
+    <4f9>   DW_AT_decl_file   : (data1) 11
+    <4fa>   DW_AT_decl_line   : (data1) 226
+    <4fb>   DW_AT_decl_column : (data1) 16
+    <4fc>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <500>   DW_AT_data_member_location: (data1) 208
+ <2><501>: Abbrev Number: 9 (DW_TAG_member)
+    <502>   DW_AT_name        : (strp) (offset: 0x192e): tp_iter
+    <506>   DW_AT_decl_file   : (data1) 11
+    <507>   DW_AT_decl_line   : (data1) 229
+    <508>   DW_AT_decl_column : (data1) 17
+    <509>   DW_AT_type        : (ref4) <0x94d>, getiterfunc, PyObject, _object
+    <50d>   DW_AT_data_member_location: (data1) 216
+ <2><50e>: Abbrev Number: 9 (DW_TAG_member)
+    <50f>   DW_AT_name        : (strp) (offset: 0x18fb): tp_iternext
+    <513>   DW_AT_decl_file   : (data1) 11
+    <514>   DW_AT_decl_line   : (data1) 230
+    <515>   DW_AT_decl_column : (data1) 18
+    <516>   DW_AT_type        : (ref4) <0x959>, iternextfunc, PyObject, _object
+    <51a>   DW_AT_data_member_location: (data1) 224
+ <2><51b>: Abbrev Number: 9 (DW_TAG_member)
+    <51c>   DW_AT_name        : (strp) (offset: 0x1280): tp_methods
+    <520>   DW_AT_decl_file   : (data1) 11
+    <521>   DW_AT_decl_line   : (data1) 233
+    <522>   DW_AT_decl_column : (data1) 25
+    <523>   DW_AT_type        : (ref4) <0xebc>, PyMethodDef
+    <527>   DW_AT_data_member_location: (data1) 232
+ <2><528>: Abbrev Number: 9 (DW_TAG_member)
+    <529>   DW_AT_name        : (strp) (offset: 0x17db): tp_members
+    <52d>   DW_AT_decl_file   : (data1) 11
+    <52e>   DW_AT_decl_line   : (data1) 234
+    <52f>   DW_AT_decl_column : (data1) 25
+    <530>   DW_AT_type        : (ref4) <0xec7>, PyMemberDef
+    <534>   DW_AT_data_member_location: (data1) 240
+ <2><535>: Abbrev Number: 9 (DW_TAG_member)
+    <536>   DW_AT_name        : (strp) (offset: 0x18e8): tp_getset
+    <53a>   DW_AT_decl_file   : (data1) 11
+    <53b>   DW_AT_decl_line   : (data1) 235
+    <53c>   DW_AT_decl_column : (data1) 25
+    <53d>   DW_AT_type        : (ref4) <0xf1c>, PyGetSetDef
+    <541>   DW_AT_data_member_location: (data1) 248
+ <2><542>: Abbrev Number: 17 (DW_TAG_member)
+    <543>   DW_AT_name        : (strp) (offset: 0x199a): tp_base
+    <547>   DW_AT_decl_file   : (data1) 11
+    <548>   DW_AT_decl_line   : (data1) 236
+    <549>   DW_AT_decl_column : (data1) 25
+    <54a>   DW_AT_type        : (ref4) <0x65e>, _typeobject
+    <54e>   DW_AT_data_member_location: (data2) 256
+ <2><550>: Abbrev Number: 17 (DW_TAG_member)
+    <551>   DW_AT_name        : (strp) (offset: 0x9c6): tp_dict
+    <555>   DW_AT_decl_file   : (data1) 11
+    <556>   DW_AT_decl_line   : (data1) 237
+    <557>   DW_AT_decl_column : (data1) 15
+    <558>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <55c>   DW_AT_data_member_location: (data2) 264
+ <2><55e>: Abbrev Number: 17 (DW_TAG_member)
+    <55f>   DW_AT_name        : (strp) (offset: 0x1921): tp_descr_get
+    <563>   DW_AT_decl_file   : (data1) 11
+    <564>   DW_AT_decl_line   : (data1) 238
+    <565>   DW_AT_decl_column : (data1) 18
+    <566>   DW_AT_type        : (ref4) <0x965>, descrgetfunc, PyObject, _object
+    <56a>   DW_AT_data_member_location: (data2) 272
+ <2><56c>: Abbrev Number: 17 (DW_TAG_member)
+    <56d>   DW_AT_name        : (strp) (offset: 0x1e1c): tp_descr_set
+    <571>   DW_AT_decl_file   : (data1) 11
+    <572>   DW_AT_decl_line   : (data1) 239
+    <573>   DW_AT_decl_column : (data1) 18
+    <574>   DW_AT_type        : (ref4) <0x971>, descrsetfunc, int
+    <578>   DW_AT_data_member_location: (data2) 280
+ <2><57a>: Abbrev Number: 17 (DW_TAG_member)
+    <57b>   DW_AT_name        : (strp) (offset: 0x7d6): tp_dictoffset
+    <57f>   DW_AT_decl_file   : (data1) 11
+    <580>   DW_AT_decl_line   : (data1) 240
+    <581>   DW_AT_decl_column : (data1) 16
+    <582>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <586>   DW_AT_data_member_location: (data2) 288
+ <2><588>: Abbrev Number: 17 (DW_TAG_member)
+    <589>   DW_AT_name        : (strp) (offset: 0x95d): tp_init
+    <58d>   DW_AT_decl_file   : (data1) 11
+    <58e>   DW_AT_decl_line   : (data1) 241
+    <58f>   DW_AT_decl_column : (data1) 14
+    <590>   DW_AT_type        : (ref4) <0x97d>, initproc, int
+    <594>   DW_AT_data_member_location: (data2) 296
+ <2><596>: Abbrev Number: 17 (DW_TAG_member)
+    <597>   DW_AT_name        : (strp) (offset: 0x119f): tp_alloc
+    <59b>   DW_AT_decl_file   : (data1) 11
+    <59c>   DW_AT_decl_line   : (data1) 242
+    <59d>   DW_AT_decl_column : (data1) 15
+    <59e>   DW_AT_type        : (ref4) <0x9b4>, allocfunc, PyObject, _object
+    <5a2>   DW_AT_data_member_location: (data2) 304
+ <2><5a4>: Abbrev Number: 17 (DW_TAG_member)
+    <5a5>   DW_AT_name        : (strp) (offset: 0xfb2): tp_new
+    <5a9>   DW_AT_decl_file   : (data1) 11
+    <5aa>   DW_AT_decl_line   : (data1) 243
+    <5ab>   DW_AT_decl_column : (data1) 13
+    <5ac>   DW_AT_type        : (ref4) <0x989>, newfunc, PyObject, _object
+    <5b0>   DW_AT_data_member_location: (data2) 312
+ <2><5b2>: Abbrev Number: 17 (DW_TAG_member)
+    <5b3>   DW_AT_name        : (strp) (offset: 0x4f9): tp_free
+    <5b7>   DW_AT_decl_file   : (data1) 11
+    <5b8>   DW_AT_decl_line   : (data1) 244
+    <5b9>   DW_AT_decl_column : (data1) 14
+    <5ba>   DW_AT_type        : (ref4) <0x852>, freefunc
+    <5be>   DW_AT_data_member_location: (data2) 320
+ <2><5c0>: Abbrev Number: 17 (DW_TAG_member)
+    <5c1>   DW_AT_name        : (strp) (offset: 0x183): tp_is_gc
+    <5c5>   DW_AT_decl_file   : (data1) 11
+    <5c6>   DW_AT_decl_line   : (data1) 245
+    <5c7>   DW_AT_decl_column : (data1) 13
+    <5c8>   DW_AT_type        : (ref4) <0x71d>, inquiry, int
+    <5cc>   DW_AT_data_member_location: (data2) 328
+ <2><5ce>: Abbrev Number: 17 (DW_TAG_member)
+    <5cf>   DW_AT_name        : (strp) (offset: 0x264): tp_bases
+    <5d3>   DW_AT_decl_file   : (data1) 11
+    <5d4>   DW_AT_decl_line   : (data1) 246
+    <5d5>   DW_AT_decl_column : (data1) 15
+    <5d6>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <5da>   DW_AT_data_member_location: (data2) 336
+ <2><5dc>: Abbrev Number: 17 (DW_TAG_member)
+    <5dd>   DW_AT_name        : (strp) (offset: 0x129a): tp_mro
+    <5e1>   DW_AT_decl_file   : (data1) 11
+    <5e2>   DW_AT_decl_line   : (data1) 247
+    <5e3>   DW_AT_decl_column : (data1) 15
+    <5e4>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <5e8>   DW_AT_data_member_location: (data2) 344
+ <2><5ea>: Abbrev Number: 17 (DW_TAG_member)
+    <5eb>   DW_AT_name        : (strp) (offset: 0x1c01): tp_cache
+    <5ef>   DW_AT_decl_file   : (data1) 11
+    <5f0>   DW_AT_decl_line   : (data1) 248
+    <5f1>   DW_AT_decl_column : (data1) 15
+    <5f2>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <5f6>   DW_AT_data_member_location: (data2) 352
+ <2><5f8>: Abbrev Number: 17 (DW_TAG_member)
+    <5f9>   DW_AT_name        : (strp) (offset: 0x1858): tp_subclasses
+    <5fd>   DW_AT_decl_file   : (data1) 11
+    <5fe>   DW_AT_decl_line   : (data1) 249
+    <5ff>   DW_AT_decl_column : (data1) 15
+    <600>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <604>   DW_AT_data_member_location: (data2) 360
+ <2><606>: Abbrev Number: 17 (DW_TAG_member)
+    <607>   DW_AT_name        : (strp) (offset: 0x15ae): tp_weaklist
+    <60b>   DW_AT_decl_file   : (data1) 11
+    <60c>   DW_AT_decl_line   : (data1) 250
+    <60d>   DW_AT_decl_column : (data1) 15
+    <60e>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <612>   DW_AT_data_member_location: (data2) 368
+ <2><614>: Abbrev Number: 17 (DW_TAG_member)
+    <615>   DW_AT_name        : (strp) (offset: 0x107e): tp_del
+    <619>   DW_AT_decl_file   : (data1) 11
+    <61a>   DW_AT_decl_line   : (data1) 251
+    <61b>   DW_AT_decl_column : (data1) 16
+    <61c>   DW_AT_type        : (ref4) <0x86f>, destructor
+    <620>   DW_AT_data_member_location: (data2) 376
+ <2><622>: Abbrev Number: 17 (DW_TAG_member)
+    <623>   DW_AT_name        : (strp) (offset: 0x16e2): tp_version_tag
+    <627>   DW_AT_decl_file   : (data1) 11
+    <628>   DW_AT_decl_line   : (data1) 254
+    <629>   DW_AT_decl_column : (data1) 18
+    <62a>   DW_AT_type        : (ref4) <0x4a>, unsigned int
+    <62e>   DW_AT_data_member_location: (data2) 384
+ <2><630>: Abbrev Number: 18 (DW_TAG_member)
+    <631>   DW_AT_name        : (strp) (offset: 0x80a): tp_finalize
+    <635>   DW_AT_decl_file   : (data1) 11
+    <636>   DW_AT_decl_line   : (data2) 256
+    <638>   DW_AT_decl_column : (data1) 16
+    <639>   DW_AT_type        : (ref4) <0x86f>, destructor
+    <63d>   DW_AT_data_member_location: (data2) 392
+ <2><63f>: Abbrev Number: 18 (DW_TAG_member)
+    <640>   DW_AT_name        : (strp) (offset: 0x16c9): tp_vectorcall
+    <644>   DW_AT_decl_file   : (data1) 11
+    <645>   DW_AT_decl_line   : (data2) 257
+    <647>   DW_AT_decl_column : (data1) 20
+    <648>   DW_AT_type        : (ref4) <0xaf5>, vectorcallfunc, PyObject, _object
+    <64c>   DW_AT_data_member_location: (data2) 400
+ <2><64e>: Abbrev Number: 18 (DW_TAG_member)
+    <64f>   DW_AT_name        : (strp) (offset: 0x1a1c): tp_print
+    <653>   DW_AT_decl_file   : (data1) 11
+    <654>   DW_AT_decl_line   : (data2) 260
+    <656>   DW_AT_decl_column : (data1) 30
+    <657>   DW_AT_type        : (ref4) <0xf41>, int
+    <65b>   DW_AT_data_member_location: (data2) 408
+ <2><65d>: Abbrev Number: 0
+ <1><65e>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <65f>   DW_AT_byte_size   : (data1) 8
+    <660>   DW_AT_type        : (ref4) <0x3ae>, _typeobject
+ <1><664>: Abbrev Number: 2 (DW_TAG_typedef)
+    <665>   DW_AT_name        : (strp) (offset: 0xda8): PyObject
+    <669>   DW_AT_decl_file   : (data1) 2
+    <66a>   DW_AT_decl_line   : (data1) 108
+    <66b>   DW_AT_decl_column : (data1) 3
+    <66c>   DW_AT_type        : (ref4) <0x386>, _object
+ <1><670>: Abbrev Number: 19 (DW_TAG_structure_type)
+    <671>   DW_AT_byte_size   : (data1) 24
+    <672>   DW_AT_decl_file   : (data1) 2
+    <673>   DW_AT_decl_line   : (data1) 113
+    <674>   DW_AT_decl_column : (data1) 9
+    <675>   DW_AT_sibling     : (ref4) <0x694>
+ <2><679>: Abbrev Number: 9 (DW_TAG_member)
+    <67a>   DW_AT_name        : (strp) (offset: 0x62c): ob_base
+    <67e>   DW_AT_decl_file   : (data1) 2
+    <67f>   DW_AT_decl_line   : (data1) 114
+    <680>   DW_AT_decl_column : (data1) 14
+    <681>   DW_AT_type        : (ref4) <0x664>, PyObject, _object
+    <685>   DW_AT_data_member_location: (data1) 0
+ <2><686>: Abbrev Number: 9 (DW_TAG_member)
+    <687>   DW_AT_name        : (strp) (offset: 0x983): ob_size
+    <68b>   DW_AT_decl_file   : (data1) 2
+    <68c>   DW_AT_decl_line   : (data1) 115
+    <68d>   DW_AT_decl_column : (data1) 16
+    <68e>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <692>   DW_AT_data_member_location: (data1) 16
+ <2><693>: Abbrev Number: 0
+ <1><694>: Abbrev Number: 2 (DW_TAG_typedef)
+    <695>   DW_AT_name        : (strp) (offset: 0x53b): PyVarObject
+    <699>   DW_AT_decl_file   : (data1) 2
+    <69a>   DW_AT_decl_line   : (data1) 116
+    <69b>   DW_AT_decl_column : (data1) 3
+    <69c>   DW_AT_type        : (ref4) <0x670>
+ <1><6a0>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6a1>   DW_AT_name        : (strp) (offset: 0x1302): unaryfunc
+    <6a5>   DW_AT_decl_file   : (data1) 2
+    <6a6>   DW_AT_decl_line   : (data1) 140
+    <6a7>   DW_AT_decl_column : (data1) 22
+    <6a8>   DW_AT_type        : (ref4) <0x6ac>, PyObject, _object
+ <1><6ac>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6ad>   DW_AT_byte_size   : (data1) 8
+    <6ae>   DW_AT_type        : (ref4) <0x6b2>, PyObject, _object
+ <1><6b2>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <6b3>   DW_AT_prototyped  : (flag_present) 1
+    <6b3>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <6b7>   DW_AT_sibling     : (ref4) <0x6c1>
+ <2><6bb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6bc>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><6c0>: Abbrev Number: 0
+ <1><6c1>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6c2>   DW_AT_byte_size   : (data1) 8
+    <6c3>   DW_AT_type        : (ref4) <0x664>, PyObject, _object
+ <1><6c7>: Abbrev Number: 7 (DW_TAG_const_type)
+    <6c8>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <1><6cc>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6cd>   DW_AT_name        : (strp) (offset: 0xa7b): binaryfunc
+    <6d1>   DW_AT_decl_file   : (data1) 2
+    <6d2>   DW_AT_decl_line   : (data1) 141
+    <6d3>   DW_AT_decl_column : (data1) 22
+    <6d4>   DW_AT_type        : (ref4) <0x6d8>, PyObject, _object
+ <1><6d8>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6d9>   DW_AT_byte_size   : (data1) 8
+    <6da>   DW_AT_type        : (ref4) <0x6de>, PyObject, _object
+ <1><6de>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <6df>   DW_AT_prototyped  : (flag_present) 1
+    <6df>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <6e3>   DW_AT_sibling     : (ref4) <0x6f2>
+ <2><6e7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6e8>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><6ec>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <6ed>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><6f1>: Abbrev Number: 0
+ <1><6f2>: Abbrev Number: 2 (DW_TAG_typedef)
+    <6f3>   DW_AT_name        : (strp) (offset: 0x620): ternaryfunc
+    <6f7>   DW_AT_decl_file   : (data1) 2
+    <6f8>   DW_AT_decl_line   : (data1) 142
+    <6f9>   DW_AT_decl_column : (data1) 22
+    <6fa>   DW_AT_type        : (ref4) <0x6fe>, PyObject, _object
+ <1><6fe>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <6ff>   DW_AT_byte_size   : (data1) 8
+    <700>   DW_AT_type        : (ref4) <0x704>, PyObject, _object
+ <1><704>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <705>   DW_AT_prototyped  : (flag_present) 1
+    <705>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <709>   DW_AT_sibling     : (ref4) <0x71d>
+ <2><70d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <70e>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><712>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <713>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><717>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <718>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><71c>: Abbrev Number: 0
+ <1><71d>: Abbrev Number: 2 (DW_TAG_typedef)
+    <71e>   DW_AT_name        : (strp) (offset: 0x13d0): inquiry
+    <722>   DW_AT_decl_file   : (data1) 2
+    <723>   DW_AT_decl_line   : (data1) 143
+    <724>   DW_AT_decl_column : (data1) 15
+    <725>   DW_AT_type        : (ref4) <0x729>, int
+ <1><729>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <72a>   DW_AT_byte_size   : (data1) 8
+    <72b>   DW_AT_type        : (ref4) <0x72f>, int
+ <1><72f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <730>   DW_AT_prototyped  : (flag_present) 1
+    <730>   DW_AT_type        : (ref4) <0x5f>, int
+    <734>   DW_AT_sibling     : (ref4) <0x73e>
+ <2><738>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <739>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><73d>: Abbrev Number: 0
+ <1><73e>: Abbrev Number: 2 (DW_TAG_typedef)
+    <73f>   DW_AT_name        : (strp) (offset: 0x51): lenfunc
+    <743>   DW_AT_decl_file   : (data1) 2
+    <744>   DW_AT_decl_line   : (data1) 144
+    <745>   DW_AT_decl_column : (data1) 22
+    <746>   DW_AT_type        : (ref4) <0x74a>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><74a>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <74b>   DW_AT_byte_size   : (data1) 8
+    <74c>   DW_AT_type        : (ref4) <0x750>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <1><750>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <751>   DW_AT_prototyped  : (flag_present) 1
+    <751>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+    <755>   DW_AT_sibling     : (ref4) <0x75f>
+ <2><759>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <75a>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><75e>: Abbrev Number: 0
+ <1><75f>: Abbrev Number: 2 (DW_TAG_typedef)
+    <760>   DW_AT_name        : (strp) (offset: 0xb42): ssizeargfunc
+    <764>   DW_AT_decl_file   : (data1) 2
+    <765>   DW_AT_decl_line   : (data1) 145
+    <766>   DW_AT_decl_column : (data1) 21
+    <767>   DW_AT_type        : (ref4) <0x76b>, PyObject, _object
+ <1><76b>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <76c>   DW_AT_byte_size   : (data1) 8
+    <76d>   DW_AT_type        : (ref4) <0x771>, PyObject, _object
+ <1><771>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <772>   DW_AT_prototyped  : (flag_present) 1
+    <772>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+    <776>   DW_AT_sibling     : (ref4) <0x785>
+ <2><77a>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <77b>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><77f>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <780>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <2><784>: Abbrev Number: 0
+ <1><785>: Abbrev Number: 2 (DW_TAG_typedef)
+    <786>   DW_AT_name        : (strp) (offset: 0x16b0): ssizeobjargproc
+    <78a>   DW_AT_decl_file   : (data1) 2
+    <78b>   DW_AT_decl_line   : (data1) 147
+    <78c>   DW_AT_decl_column : (data1) 14
+    <78d>   DW_AT_type        : (ref4) <0x791>, int
+ <1><791>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <792>   DW_AT_byte_size   : (data1) 8
+    <793>   DW_AT_type        : (ref4) <0x797>, int
+ <1><797>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <798>   DW_AT_prototyped  : (flag_present) 1
+    <798>   DW_AT_type        : (ref4) <0x5f>, int
+    <79c>   DW_AT_sibling     : (ref4) <0x7b0>
+ <2><7a0>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7a1>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><7a5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7a6>   DW_AT_type        : (ref4) <0x328>, Py_ssize_t, ssize_t, __ssize_t, long int
+ <2><7aa>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7ab>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><7af>: Abbrev Number: 0
+ <1><7b0>: Abbrev Number: 2 (DW_TAG_typedef)
+    <7b1>   DW_AT_name        : (strp) (offset: 0x975): objobjargproc
+    <7b5>   DW_AT_decl_file   : (data1) 2
+    <7b6>   DW_AT_decl_line   : (data1) 149
+    <7b7>   DW_AT_decl_column : (data1) 14
+    <7b8>   DW_AT_type        : (ref4) <0x7bc>, int
+ <1><7bc>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <7bd>   DW_AT_byte_size   : (data1) 8
+    <7be>   DW_AT_type        : (ref4) <0x7c2>, int
+ <1><7c2>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <7c3>   DW_AT_prototyped  : (flag_present) 1
+    <7c3>   DW_AT_type        : (ref4) <0x5f>, int
+    <7c7>   DW_AT_sibling     : (ref4) <0x7db>
+ <2><7cb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7cc>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><7d0>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7d1>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><7d5>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7d6>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><7da>: Abbrev Number: 0
+ <1><7db>: Abbrev Number: 2 (DW_TAG_typedef)
+    <7dc>   DW_AT_name        : (strp) (offset: 0x1f19): objobjproc
+    <7e0>   DW_AT_decl_file   : (data1) 2
+    <7e1>   DW_AT_decl_line   : (data1) 151
+    <7e2>   DW_AT_decl_column : (data1) 15
+    <7e3>   DW_AT_type        : (ref4) <0x7e7>, int
+ <1><7e7>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <7e8>   DW_AT_byte_size   : (data1) 8
+    <7e9>   DW_AT_type        : (ref4) <0x7ed>, int
+ <1><7ed>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <7ee>   DW_AT_prototyped  : (flag_present) 1
+    <7ee>   DW_AT_type        : (ref4) <0x5f>, int
+    <7f2>   DW_AT_sibling     : (ref4) <0x801>
+ <2><7f6>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7f7>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><7fb>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <7fc>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><800>: Abbrev Number: 0
+ <1><801>: Abbrev Number: 2 (DW_TAG_typedef)
+    <802>   DW_AT_name        : (strp) (offset: 0x41e): visitproc
+    <806>   DW_AT_decl_file   : (data1) 2
+    <807>   DW_AT_decl_line   : (data1) 152
+    <808>   DW_AT_decl_column : (data1) 15
+    <809>   DW_AT_type        : (ref4) <0x80d>, int
+ <1><80d>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <80e>   DW_AT_byte_size   : (data1) 8
+    <80f>   DW_AT_type        : (ref4) <0x813>, int
+ <1><813>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <814>   DW_AT_prototyped  : (flag_present) 1
+    <814>   DW_AT_type        : (ref4) <0x5f>, int
+    <818>   DW_AT_sibling     : (ref4) <0x827>
+ <2><81c>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <81d>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><821>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <822>   DW_AT_type        : (ref4) <0x85>
+ <2><826>: Abbrev Number: 0
+ <1><827>: Abbrev Number: 2 (DW_TAG_typedef)
+    <828>   DW_AT_name        : (strp) (offset: 0x1376): traverseproc
+    <82c>   DW_AT_decl_file   : (data1) 2
+    <82d>   DW_AT_decl_line   : (data1) 153
+    <82e>   DW_AT_decl_column : (data1) 15
+    <82f>   DW_AT_type        : (ref4) <0x833>, int
+ <1><833>: Abbrev Number: 6 (DW_TAG_pointer_type)
+    <834>   DW_AT_byte_size   : (data1) 8
+    <835>   DW_AT_type        : (ref4) <0x839>, int
+ <1><839>: Abbrev Number: 20 (DW_TAG_subroutine_type)
+    <83a>   DW_AT_prototyped  : (flag_present) 1
+    <83a>   DW_AT_type        : (ref4) <0x5f>, int
+    <83e>   DW_AT_sibling     : (ref4) <0x852>
+ <2><842>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <843>   DW_AT_type        : (ref4) <0x6c1>, PyObject, _object
+ <2><847>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <848>   DW_AT_type        : (ref4) <0x801>, visitproc, int
+ <2><84c>: Abbrev Number: 21 (DW_TAG_formal_parameter)
+    <84d>   DW_AT_type        : (ref4) <0x85>
+ <2><851>: Abbrev Number: 0
+ <1><852>: Abbrev Number: 2 (DW_TAG_typedef)
+    <853>   DW_AT_name        : (strp) (offset: 0x18a6): freefunc
